'''
Created on 2013/3/3

@author: Ihc
'''
import postgresql
資料庫連線 = postgresql.open(host = "localhost", port = 5432, user = "Ihc", password = "983781", database = "言語系統")
文字組合符號 = ','
會當替換 = '會當替換'
袂當替換 = '袂當替換'
義近 = '義近'
義倒 = '義倒'

資料庫加文字 = lambda 來源, 種類, 腔口, 地區, 年代, 型體, 音標: 資料庫連線.prepare('INSERT INTO "言語"."文字" ' +
    '("來源","種類","腔口","地區","年代","型體","音標") ' +
    'VALUES ($1,$2,$3,$4,$5,$6,$7) ')(來源, 種類, 腔口, 地區, 年代, 型體, 音標)
加編修狀況 = 資料庫連線.prepare('INSERT INTO "言語"."編修" ' +
    '("流水號","資料種類") ' + 'VALUES ($1,$2)')
揣文字上大流水號資料 = 資料庫連線.prepare('SELECT MAX("流水號") ' +
    'FROM "言語"."文字"')
揣文字上大流水號 = lambda:揣文字上大流水號資料.first()
def 加文字(來源, 種類, 腔口, 地區, 年代, 型體, 音標):
	資料庫加文字(來源, 種類, 腔口, 地區, 年代, 型體, 音標)
	流水號 = 揣文字上大流水號()
	加編修狀況(流水號, '文字')
