from unittest.case import TestCase
from 臺灣言語工具.解析整理.拆文分析器 import 拆文分析器
from 臺灣言語工具.解析整理.型態錯誤 import 型態錯誤
from 臺灣言語工具.基本物件.句 import 句
from 臺灣言語工具.基本物件.集 import 集
from 臺灣言語工具.綜合標音.閩南語字綜合標音 import 閩南語字綜合標音


class 句單元試驗(TestCase):

    def test_句烏白傳(self):
        self.assertRaises(型態錯誤, 句, None)
        self.assertRaises(型態錯誤, 句, [None])
        self.assertRaises(型態錯誤, 句, ['sui2'])

    def test_看句(self):
        型 = '恁老母ti3佗位'
        音 = 'lin1 lau3 bu2 ti3 to1 ui7'
        句物件 = 拆文分析器.對齊句物件(型, 音)
        self.assertEqual(句物件.看型(), 型)
        self.assertEqual(句物件.看音(), 音)
        分詞 = '恁｜lin1 老｜lau3 母｜bu2 ti3｜ti3 佗｜to1 位｜ui7'
        self.assertEqual(句物件.看分詞(), 分詞)

    def test_基本綜合標音(self):
        我 = 拆文分析器.對齊集物件('我', 'gua2')
        愛 = 拆文分析器.對齊集物件('愛', 'ai3')
        媠某 = 拆文分析器.對齊組物件('美女', 'sui2-boo2')
        美女 = 拆文分析器.對齊組物件('美女', 'mi2-lu2')
        莉 = 集([媠某, 美女])
        句物件 = 句([我, 愛, 莉])
        綜合標音 = 句物件.綜合標音(閩南語字綜合標音)
        self.assertEqual(綜合標音[0], 我.綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音[1], 愛.綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音[2], 莉.綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音, [
            [{'詞組綜合標音': [
                         {"型體": "我", "臺羅數字調": "gua2", "臺羅閏號調": "guá", "通用數字調": "ghua4", "吳守禮方音": "⿿⿿⿿ㆣㄨㄚˋ"}],
              "連字音": "gua2"}],
            [{"詞組綜合標音": [
                {"型體": "愛", "臺羅數字調": "ai3", "臺羅閏號調": "ài", "通用數字調": "ai3", "吳守禮方音": "⿿ㄞ˪"}],
              "連字音": "ai3"}],
            [{"詞組綜合標音": [
                {"型體": "美", "臺羅數字調": "sui2", "臺羅閏號調": "suí",
                 "通用數字調": "sui4", "吳守禮方音": "⿿⿿⿿ㄙㄨㄧˋ"},
                {"型體": "女", "臺羅數字調": "boo2", "臺羅閏號調": "bóo", "通用數字調": "bho4", "吳守禮方音": "⿿⿿ㆠㆦˋ"}],
              "連字音": "sui2-boo2"},
             {"詞組綜合標音": [
                 {"型體": "美", "臺羅數字調": "mi2", "臺羅閏號調": "mí",
                  "通用數字調": "mi4", "吳守禮方音": "⿿⿿ㄇㄧˋ"},
                 {"型體": "女", "臺羅數字調": "lu2", "臺羅閏號調": "lú", "通用數字調": "lu4", "吳守禮方音": "⿿⿿ㄌㄨˋ"}],
              "連字音": "mi2-lu2"}],
        ])

    def test_一句無連字轉json格式(self):
        句物件 = 拆文分析器.對齊句物件('點仔膠，黏著跤，', 'tiam2 a2 ka1, liam5 tioh8 kha1,')
        self.assertEqual(句物件.綜合標音(閩南語字綜合標音), [[{'詞組綜合標音': [
            {'通用數字調': 'diam4', '吳守禮方音': '⿿⿿⿿ㄉㄧㆰˋ',
                '臺羅閏號調': 'tiám', '臺羅數字調': 'tiam2', '型體': '點'},
            {'通用數字調': 'a4', '吳守禮方音': '⿿ㄚˋ',
                '臺羅閏號調': 'á', '臺羅數字調': 'a2', '型體': '仔'},
            {'通用數字調': 'ga1', '吳守禮方音': '⿿ㄍㄚ',
                '臺羅閏號調': 'ka', '臺羅數字調': 'ka1', '型體': '膠'},
            {'通用數字調': ',', '吳守禮方音': '', '臺羅閏號調': ',', '臺羅數字調': ',', '型體': '，'},
            {'通用數字調': 'liam5', '吳守禮方音': '⿿⿿⿿ㄌㄧㆰˊ',
                '臺羅閏號調': 'liâm', '臺羅數字調': 'liam5', '型體': '黏'},
            {'通用數字調': 'diorh6', '吳守禮方音': '⿿⿿⿿⿿ㄉㄧㄜ㆐ㆷ',
                '臺羅閏號調': 'tio̍h', '臺羅數字調': 'tioh8', '型體': '著'},
            {'通用數字調': 'ka1', '吳守禮方音': '⿿ㄎㄚ',
                '臺羅閏號調': 'kha', '臺羅數字調': 'kha1', '型體': '跤'},
            {'通用數字調': ',', '吳守禮方音': '', '臺羅閏號調': ',', '臺羅數字調': ',', '型體': '，'}
        ], '連字音': 'tiam2 a2 ka1 , liam5 tioh8 kha1 ,'}]])

    def test_一句連字轉json格式(self):
        句物件 = 拆文分析器.對齊句物件('點仔膠，黏著跤，', 'tiam2-a2-ka1, liam5-tioh8 kha1,')
        self.assertEqual(句物件.綜合標音(閩南語字綜合標音), [[{'詞組綜合標音': [
            {'通用數字調': 'diam4', '吳守禮方音': '⿿⿿⿿ㄉㄧㆰˋ',
                '臺羅閏號調': 'tiám', '臺羅數字調': 'tiam2', '型體': '點'},
            {'通用數字調': 'a4', '吳守禮方音': '⿿ㄚˋ',
                '臺羅閏號調': 'á', '臺羅數字調': 'a2', '型體': '仔'},
            {'通用數字調': 'ga1', '吳守禮方音': '⿿ㄍㄚ',
                '臺羅閏號調': 'ka', '臺羅數字調': 'ka1', '型體': '膠'},
            {'通用數字調': ',', '吳守禮方音': '', '臺羅閏號調': ',', '臺羅數字調': ',', '型體': '，'},
            {'通用數字調': 'liam5', '吳守禮方音': '⿿⿿⿿ㄌㄧㆰˊ',
                '臺羅閏號調': 'liâm', '臺羅數字調': 'liam5', '型體': '黏'},
            {'通用數字調': 'diorh6', '吳守禮方音': '⿿⿿⿿⿿ㄉㄧㄜ㆐ㆷ',
                '臺羅閏號調': 'tio̍h', '臺羅數字調': 'tioh8', '型體': '著'},
            {'通用數字調': 'ka1', '吳守禮方音': '⿿ㄎㄚ',
                '臺羅閏號調': 'kha', '臺羅數字調': 'kha1', '型體': '跤'},
            {'通用數字調': ',', '吳守禮方音': '', '臺羅閏號調': ',', '臺羅數字調': ',', '型體': '，'}
        ], '連字音': 'tiam2-a2-ka1 , liam5-tioh8 kha1 ,'}]])

    def test_一句濟詞無連字轉json格式(self):
        句物件 = 句([
                拆文分析器.對齊集物件('點', 'tiam2'),
                拆文分析器.對齊集物件('仔', 'a2'),
                拆文分析器.對齊集物件('膠', 'ka1'),
                拆文分析器.對齊集物件('，', ','),
                拆文分析器.對齊集物件('黏', 'liam5'),
                拆文分析器.對齊集物件('著', 'tioh8'),
                拆文分析器.對齊集物件('跤', 'kha1'),
                拆文分析器.對齊集物件('，', ',')
                ])
        self.assertEqual(句物件.綜合標音(閩南語字綜合標音), [
            [{"詞組綜合標音": [
                {"型體": "點", "臺羅數字調": "tiam2", "臺羅閏號調": "tiám", "通用數字調": "diam4", "吳守禮方音": "⿿⿿⿿ㄉㄧㆰˋ"}],
              "連字音": "tiam2"}],
            [{"詞組綜合標音": [
                {"型體": "仔", "臺羅數字調": "a2", "臺羅閏號調": "á", "通用數字調": "a4", "吳守禮方音": "⿿ㄚˋ"}],
              "連字音": "a2"}],
            [{"詞組綜合標音": [
                {"型體": "膠", "臺羅數字調": "ka1", "臺羅閏號調": "ka", "通用數字調": "ga1", "吳守禮方音": "⿿ㄍㄚ"}],
              "連字音": "ka1"}],
            [{"詞組綜合標音": [
                {"型體": "，", "臺羅數字調": ",", "臺羅閏號調": ",", "通用數字調": ",", "吳守禮方音": ""}],
              "連字音": ","}],
            [{"詞組綜合標音": [
                {"型體": "黏", "臺羅數字調": "liam5", "臺羅閏號調": "liâm", "通用數字調": "liam5", "吳守禮方音": "⿿⿿⿿ㄌㄧㆰˊ"}],
              "連字音": "liam5"}],
            [{"詞組綜合標音": [
                {"型體": "著", "臺羅數字調": "tioh8", "臺羅閏號調": "tio̍h", "通用數字調": "diorh6", "吳守禮方音": "⿿⿿⿿⿿ㄉㄧㄜ㆐ㆷ"}],
              "連字音": "tioh8"}],
            [{"詞組綜合標音": [
                {"型體": "跤", "臺羅數字調": "kha1", "臺羅閏號調": "kha", "通用數字調": "ka1", "吳守禮方音": "⿿ㄎㄚ"}],
              "連字音": "kha1"}],
            [{"詞組綜合標音": [
                {"型體": "，", "臺羅數字調": ",", "臺羅閏號調": ",", "通用數字調": ",", "吳守禮方音": ""}],
              "連字音": ","}]
        ])

    def test_一句濟詞連字轉json格式(self):
        句物件 = 句([
                拆文分析器.對齊集物件('點仔膠', 'tiam2-a2-ka1'),
                拆文分析器.對齊集物件('，', ','),
                拆文分析器.對齊集物件('黏著', 'liam5-tioh8'),
                拆文分析器.對齊集物件('跤', 'kha1'),
                拆文分析器.對齊集物件('，', ',')
                ])
        self.assertEqual(句物件.綜合標音(閩南語字綜合標音), [
            [{"詞組綜合標音": [
                {"型體": "點", "臺羅數字調": "tiam2", "臺羅閏號調": "tiám",
                    "通用數字調": "diam4", "吳守禮方音": "⿿⿿⿿ㄉㄧㆰˋ"},
                {"型體": "仔", "臺羅數字調": "a2", "臺羅閏號調": "á",
                    "通用數字調": "a4", "吳守禮方音": "⿿ㄚˋ"},
                {"型體": "膠", "臺羅數字調": "ka1", "臺羅閏號調": "ka",
                    "通用數字調": "ga1", "吳守禮方音": "⿿ㄍㄚ"}
            ],
                "連字音": "tiam2-a2-ka1"}],
            [{"詞組綜合標音": [
                {"型體": "，", "臺羅數字調": ",", "臺羅閏號調": ",", "通用數字調": ",", "吳守禮方音": ""}],
              "連字音": ","}],
            [{"詞組綜合標音": [
                {"型體": "黏", "臺羅數字調": "liam5", "臺羅閏號調": "liâm",
                    "通用數字調": "liam5", "吳守禮方音": "⿿⿿⿿ㄌㄧㆰˊ"},
                {"型體": "著", "臺羅數字調": "tioh8", "臺羅閏號調": "tio̍h",
                    "通用數字調": "diorh6", "吳守禮方音": "⿿⿿⿿⿿ㄉㄧㄜ㆐ㆷ"}
            ],
                "連字音": "liam5-tioh8"}],
            [{"詞組綜合標音": [
                {"型體": "跤", "臺羅數字調": "kha1", "臺羅閏號調": "kha", "通用數字調": "ka1", "吳守禮方音": "⿿ㄎㄚ"}],
              "連字音": "kha1"}],
            [{"詞組綜合標音": [
                {"型體": "，", "臺羅數字調": ",", "臺羅閏號調": ",", "通用數字調": ",", "吳守禮方音": ""}],
              "連字音": ","}]
        ])
