from unittest.case import TestCase
from 臺灣言語工具.解析整理.拆文分析器 import 拆文分析器
from 臺灣言語工具.基本物件.公用變數 import 分字符號
from 臺灣言語工具.解析整理.型態錯誤 import 型態錯誤
from 臺灣言語工具.基本物件.章 import 章
from 臺灣言語工具.綜合標音.閩南語字綜合標音 import 閩南語字綜合標音
from 臺灣言語工具.基本物件.集 import 集
from 臺灣言語工具.基本物件.句 import 句


class 章單元試驗(TestCase):

    def test_章烏白傳(self):
        self.assertRaises(型態錯誤, 章, None)
        self.assertRaises(型態錯誤, 章, [None])
        self.assertRaises(型態錯誤, 章, ['sui2'])

    def test_看章(self):
        型 = '恁老母ti3佗位！恁老母ti3佗位！'
        音 = 'lin1 lau3 bu2 ti3 to1 ui7 ! lin1 lau3 bu2 ti3 to1 ui7 !'
        章物件 = 拆文分析器.對齊章物件(型, 音)
        self.assertEqual(章物件.看型(), 型)
        self.assertEqual(章物件.看音(), 音)
        分詞 = '恁｜lin1 老｜lau3 母｜bu2 ti3｜ti3 佗｜to1 位｜ui7 ！｜! 恁｜lin1 老｜lau3 母｜bu2 ti3｜ti3 佗｜to1 位｜ui7 ！｜!'
        self.assertEqual(章物件.看分詞(), 分詞)
        self.assertEqual(章物件.看分詞('｜'), 分詞)
        分詞加 = '恁+lin1 老+lau3 母+bu2 ti3+ti3 佗+to1 位+ui7 ！+! 恁+lin1 老+lau3 母+bu2 ti3+ti3 佗+to1 位+ui7 ！+!'
        self.assertEqual(章物件.看分詞('+'), 分詞加)

    def test_看章加連字符(self):
        型 = '恁老母ti3佗位！恁lau3-bu2-ti3佗位！'
        音 = 'lin1 lau3-bu2 ti3 to1 ui7 ! lin1 lau3-bu2-ti3 to1-ui7 !'
        章物件 = 拆文分析器.對齊章物件(型, 音)
        無分字型 = 型.replace(分字符號, '')
        self.assertEqual(章物件.看型(), 無分字型)
        self.assertEqual(章物件.看音(), 音)
        分詞 = '恁｜lin1 老-母｜lau3-bu2 ti3｜ti3 佗｜to1 位｜ui7 ！｜! 恁｜lin1 lau3-bu2-ti3｜lau3-bu2-ti3 佗-位｜to1-ui7 ！｜!'
        self.assertEqual(章物件.看分詞(), 分詞)
        self.assertEqual(章物件.看分詞('｜'), 分詞)
        self.assertEqual(章物件.看分詞(物件分型音符號='｜'), 分詞)

    def test_看章換連字符(self):
        型 = '恁老母ti3佗位！恁老母ti3佗位！'
        音 = 'lin1 lau3-bu2 ti3 to1 ui7 ! lin1 lau3-bu2-ti3 to1-ui7 !'
        答型 = '恁|老_母|ti3|佗|位|！^恁|老_母_ti3|佗_位|！'
        答音 = 'lin1|lau3_bu2|ti3|to1|ui7|!^lin1|lau3_bu2_ti3|to1_ui7|!'
        章物件 = 拆文分析器.對齊章物件(型, 音)
        self.assertEqual(章物件.看型('_', '|', '^'), 答型)
        self.assertEqual(章物件.看音('_', '|', '^'), 答音)
        self.assertEqual(
            章物件.看型(物件分字符號='_', 物件分詞符號='|', 物件分句符號='^'), 答型)
        self.assertEqual(
            章物件.看音(物件分字符號='_', 物件分詞符號='|', 物件分句符號='^'), 答音)
        分詞 = '恁@lin1^老_母@lau3_bu2^ti3@ti3^佗@to1^位@ui7^！@!|恁@lin1^老_母_ti3@lau3_bu2_ti3^佗_位@to1_ui7^！@!'
        self.assertEqual(章物件.看分詞('@', '_', '^', '|'), 分詞)
        self.assertEqual(
            章物件.看分詞(物件分型音符號='@', 物件分字符號='_', 物件分詞符號='^', 物件分句符號='|'), 分詞
        )

    def test_預設分句符號(self):
        原本語句 = '食-飽｜tsiah8-pa2 未｜0bue7 ？｜? 食-飽｜tsiah8-pa2 矣｜0ah4 ！｜!'
        章物件 = 拆文分析器.分詞章物件(原本語句)
        self.assertEqual(章物件.看型(),
                         '食飽未？食飽矣！')
        self.assertEqual(章物件.看音(),
                         'tsiah8-pa2 0bue7 ? tsiah8-pa2 0ah4 !')
        self.assertEqual(章物件.看分詞(),
                         '食-飽｜tsiah8-pa2 未｜0bue7 ？｜? 食-飽｜tsiah8-pa2 矣｜0ah4 ！｜!')

    def test_換句分句符號(self):
        原本語句 = '食-飽｜tsiah8-pa2 未｜0bue7 ？｜? 食-飽｜tsiah8-pa2 矣｜0ah4 ！｜!'
        章物件 = 拆文分析器.分詞章物件(原本語句)
        self.assertEqual(章物件.看型(物件分句符號='\n'),
                         '食飽未？\n食飽矣！')
        self.assertEqual(章物件.看音(物件分句符號='\n'),
                         'tsiah8-pa2 0bue7 ?\ntsiah8-pa2 0ah4 !')
        self.assertEqual(章物件.看分詞(物件分句符號='\n'),
                         '食-飽｜tsiah8-pa2 未｜0bue7 ？｜?\n食-飽｜tsiah8-pa2 矣｜0ah4 ！｜!')

    def test_綜合標音章物件(self):
        章物件 = 拆文分析器.對齊章物件('點仔膠，黏著跤，', 'tiam2-a2-ka1, liam5-tioh8 kha1,')
        self.assertEqual(章物件.綜合標音(閩南語字綜合標音), [
            [{'詞組綜合標音': [
                {'通用數字調': 'diam4', '吳守禮方音': '⿿⿿⿿ㄉㄧㆰˋ',
                    '臺羅閏號調': 'tiám', '臺羅數字調': 'tiam2', '型體': '點'},
                {'通用數字調': 'a4', '吳守禮方音': '⿿ㄚˋ',
                    '臺羅閏號調': 'á', '臺羅數字調': 'a2', '型體': '仔'},
                {'通用數字調': 'ga1', '吳守禮方音': '⿿ㄍㄚ',
                    '臺羅閏號調': 'ka', '臺羅數字調': 'ka1', '型體': '膠'},
                {'通用數字調': ',', '吳守禮方音': '', '臺羅閏號調': ',',
                    '臺羅數字調': ',', '型體': '，'}
            ], '連字音': 'tiam2-a2-ka1 ,'}],
            [{'詞組綜合標音': [
                {'通用數字調': 'liam5', '吳守禮方音': '⿿⿿⿿ㄌㄧㆰˊ',
                    '臺羅閏號調': 'liâm', '臺羅數字調': 'liam5', '型體': '黏'},
                {'通用數字調': 'diorh6', '吳守禮方音': '⿿⿿⿿⿿ㄉㄧㄜ㆐ㆷ',
                    '臺羅閏號調': 'tio̍h', '臺羅數字調': 'tioh8', '型體': '著'},
                {'通用數字調': 'ka1', '吳守禮方音': '⿿ㄎㄚ',
                    '臺羅閏號調': 'kha', '臺羅數字調': 'kha1', '型體': '跤'},
                {'通用數字調': ',', '吳守禮方音': '', '臺羅閏號調': ',',
                    '臺羅數字調': ',', '型體': '，'}
            ], '連字音': 'liam5-tioh8 kha1 ,'}]])

    def test_綜合標音複雜章物件(self):
        我 = 拆文分析器.對齊集物件('我', 'gua2')
        愛 = 拆文分析器.對齊集物件('愛', 'ai3')
        媠某 = 拆文分析器.對齊組物件('美女', 'sui2-boo2')
        美女 = 拆文分析器.對齊組物件('美女', 'mi2-lu2')
        莉 = 集([媠某, 美女])
        句物件 = 句([我, 愛, 莉])
        章物件 = 章([句物件, 句物件])
        self.assertEqual(章物件.綜合標音(閩南語字綜合標音), [
            [{'詞組綜合標音': [
                {"型體": "我", "臺羅數字調": "gua2", "臺羅閏號調": "guá", "通用數字調": "ghua4", "吳守禮方音": "⿿⿿⿿ㆣㄨㄚˋ"}],
              "連字音": "gua2"}],
            [{"詞組綜合標音": [
                {"型體": "愛", "臺羅數字調": "ai3", "臺羅閏號調": "ài", "通用數字調": "ai3", "吳守禮方音": "⿿ㄞ˪"}],
              "連字音": "ai3"}],
            [{"詞組綜合標音": [
                {"型體": "美", "臺羅數字調": "sui2", "臺羅閏號調": "suí",
                    "通用數字調": "sui4", "吳守禮方音": "⿿⿿⿿ㄙㄨㄧˋ"},
                {"型體": "女", "臺羅數字調": "boo2", "臺羅閏號調": "bóo", "通用數字調": "bho4", "吳守禮方音": "⿿⿿ㆠㆦˋ"}],
              "連字音": "sui2-boo2"},
             {"詞組綜合標音": [
                 {"型體": "美", "臺羅數字調": "mi2", "臺羅閏號調": "mí",
                  "通用數字調": "mi4", "吳守禮方音": "⿿⿿ㄇㄧˋ"},
                 {"型體": "女", "臺羅數字調": "lu2", "臺羅閏號調": "lú", "通用數字調": "lu4", "吳守禮方音": "⿿⿿ㄌㄨˋ"}],
              "連字音": "mi2-lu2"}], [{'詞組綜合標音': [
                  {"型體": "我", "臺羅數字調": "gua2", "臺羅閏號調": "guá", "通用數字調": "ghua4", "吳守禮方音": "⿿⿿⿿ㆣㄨㄚˋ"}],
                  "連字音": "gua2"}],
            [{"詞組綜合標音": [
                {"型體": "愛", "臺羅數字調": "ai3", "臺羅閏號調": "ài", "通用數字調": "ai3", "吳守禮方音": "⿿ㄞ˪"}],
              "連字音": "ai3"}],
            [{"詞組綜合標音": [
                {"型體": "美", "臺羅數字調": "sui2", "臺羅閏號調": "suí",
                    "通用數字調": "sui4", "吳守禮方音": "⿿⿿⿿ㄙㄨㄧˋ"},
                {"型體": "女", "臺羅數字調": "boo2", "臺羅閏號調": "bóo", "通用數字調": "bho4", "吳守禮方音": "⿿⿿ㆠㆦˋ"}],
              "連字音": "sui2-boo2"},
             {"詞組綜合標音": [
                 {"型體": "美", "臺羅數字調": "mi2", "臺羅閏號調": "mí",
                  "通用數字調": "mi4", "吳守禮方音": "⿿⿿ㄇㄧˋ"},
                 {"型體": "女", "臺羅數字調": "lu2", "臺羅閏號調": "lú", "通用數字調": "lu4", "吳守禮方音": "⿿⿿ㄌㄨˋ"}],
              "連字音": "mi2-lu2"}],
        ])
