from 臺灣言語工具.語音合成.閩南語音韻.變調判斷 import 變調判斷
from 臺灣言語工具.音標系統.閩南語.臺灣閩南語羅馬字拼音 import 臺灣閩南語羅馬字拼音


def 台灣話口語講法(句物件):
    結果句物件 = 句物件.轉音(臺灣閩南語羅馬字拼音, 函式='音值')
    判斷陣列 = 變調判斷.判斷(結果句物件)
    這馬所在 = 0
    for 詞物件, 原底詞 in zip(結果句物件.網出詞物件(), 句物件.網出詞物件()):
        新陣列 = []
        for 字物件, 原底字 in zip(詞物件.內底字, 原底詞.內底字):
            變調方式 = 判斷陣列[這馬所在]
            if 變調方式 == 變調判斷.愛提掉的:
                pass
            else:
                if 字物件.音 == (None,):
                    新陣列.append(原底字.khóopih字())
                else:
                    字物件.音 = ''.join(變調方式.變調(字物件.音))
                    新陣列.append(字物件)
            這馬所在 += 1
        詞物件.內底字 = 新陣列
    return 結果句物件.看音()
