# -*- coding: utf-8 -*-
from 臺灣言語工具.語音合成.語音標仔轉換 import 語音標仔轉換

# 前音-此音+後音/調：調類/詞：第幾音節!上尾第幾音節@攏總音節/句：第幾詞^上尾第幾詞_攏總詞


class 南島語語音標仔轉換(語音標仔轉換):

    @classmethod
    def _句物件轉合成前置資料(cls, 句物件):
        詞陣列 = 句物件.網出詞物件()
        攏總詞數量 = len(詞陣列)
        句中第幾詞 = 0
        全部詞資料 = []
        全部音節資料 = []
        全部音素資料 = []
        for 句中第幾詞, 詞物件 in enumerate(詞陣列):
            [字物件] = 詞物件.篩出字物件()
            攏總音節數量 = len(字物件.音)
            if 攏總音節數量 == 0:
                全部音素資料.append((cls.恬音, len(全部音節資料)))
                全部音節資料.append((cls.免知, 0, 1, len(全部詞資料)))
            else:
                for 詞中第幾个音節, 音節 in enumerate(字物件.音):
                    for 音素 in 音節:
                        全部音素資料.append((音素, len(全部音節資料)))
                    調 = cls.免知
                    全部音節資料.append((調, 詞中第幾个音節, 攏總音節數量, len(全部詞資料)))
            全部詞資料.append((句中第幾詞, 攏總詞數量))
        return 全部音素資料, 全部音節資料, 全部詞資料
