from 資料庫.資料庫連線 import 資料庫連線
from 資料佮語料匯入整合.教育部臺灣客家語常用詞辭典.客話辭典正規化 import 客話辭典正規化
from 字詞組集句章.解析整理工具.拆文分析器 import 拆文分析器

揣全部資料 = 資料庫連線.prepare('SELECT "編號","詞目","詞性","四縣音","海陸音","大埔音","饒平音","詔安音","釋義","近義詞","反義詞","文白讀","又音","多音字","對應華語" FROM "教育部臺灣客家語常用詞辭典"."網頁資料"')
class 整合客話辭典():
    def __init__(self):
        辭典正規化 = 客話辭典正規化()
        分析器 = 拆文分析器()
        全部資料 = 揣全部資料()
        算=0
        for 編號, 詞目, 詞性, 四縣音, 海陸音, 大埔音, 饒平音, 詔安音, 釋義, 近義詞, 反義詞, \
            文白讀, 又音, 多音字, 對應華語 in 全部資料:
            for 音標 in [四縣音, 海陸音, 大埔音, 饒平音, 詔安音]:
                新音 = 辭典正規化.處理音標(音標)
                if 新音!='':
                    try:
                        分析器.產生對齊句(詞目, 新音)
                    except:
                        print('錯誤！！', 編號, 詞目, 新音, '原音標：', 音標,)
                        算+=1
        print(算)
                

if __name__ == '__main__':
    整合客話辭典()
