"""
著作權所有 (C) 民國102年 意傳文化科技
開發者：薛丞宏
網址：http://意傳.台灣
語料來源：請看各資料庫內說明

本程式乃自由軟體，您必須遵照SocialCalc設計的通用公共授權（Common Public Attribution License, CPAL)來修改和重新發佈這一程式，詳情請參閱條文。授權大略如下，若有歧異，以授權原文為主：
	１．得使用、修改、複製並發佈此程式碼，且必須以通用公共授權發行；
	２．任何以程式碼衍生的執行檔或網路服務，必須公開該程式碼；
	３．將此程式的原始碼當函式庫引用入商業軟體，且不需公開非關此函式庫的任何程式碼

此開放原始碼、共享軟體或說明文件之使用或散佈不負擔保責任，並拒絕負擔因使用上述軟體或說明文件所致任何及一切賠償責任或損害。

臺灣言語工具緣起於本土文化推廣與傳承，非常歡迎各界用於商業軟體，但希望在使用之餘，能夠提供建議、錯誤回報或修補，回饋給這塊土地。

感謝您的使用與推廣～～勞力！承蒙！
"""
class 調號處理:
	四縣表 = [
		('55', ''), ('24', 'ˊ'),
		('11', 'ˇ'), ('31', 'ˋ'),
		('53', '^'),  # 「分佢」（bun24 gi11）=>「畀」（bi53）
		('b2', 'bˋ'), ('b5', 'b'),
		('d2', 'dˋ'), ('d5', 'd'),
		('g2', 'gˋ'), ('g5', 'g'),
		]
	海陸表 = [
		('55', ''), ('24', 'ˊ'),
		('11', 'ˇ'), ('53', 'ˋ'), ('33', '+'),
		('b2', 'bˋ'), ('b5', 'b'),
		('d2', 'dˋ'), ('d5', 'd'),
		('g2', 'gˋ'), ('g5', 'g'),
		]
	大埔表 = [
		('31', '^'),
		('113', 'ˇ'), ('53', 'ˋ'), ('33', '+'),
		('35', 'ˊ'),  # ◎大埔腔陰平調變調為 35 時，其調號為「ˊ」。
		('55', ''),#喇叭的「叭」
		('54', 'ˋ'),#rhidˋ gai54 ngiunˇ
		('b21', 'bˋ'),
		('d21', 'dˋ'),
		('g21', 'gˋ'),
		('b2', 'bˋ'), ('b54', 'b'),
		('d2', 'dˋ'), ('d54', 'd'),
		('g2', 'gˋ'), ('g54', 'g'),
		]
	饒平表 = [
		('55', ''), ('24', 'ˊ'),
		('11', 'ˇ'), ('53', 'ˋ'),
		('31', '^'),  # 卓蘭腔
		
		('b2', 'bˋ'), ('b5', 'b'),
		('d2', 'dˋ'), ('d5', 'd'),
		('g2', 'gˋ'), ('g5', 'g'),
		]
	詔安表 = [
		('55', ''), ('31', '^'),
		('11', 'ˇ'), ('53', 'ˋ'),
		('b5', 'bˋ'), ('b24', 'bˊ'),
		('d5', 'dˋ'), ('d24', 'dˊ'),
		('g5', 'gˋ'), ('g24', 'gˊ'),
		('24', 'ˊ'), ('43', 'ˋ'),  # 入聲
		]
	def 數字轉調號(self, 音, 腔):
		if '四縣腔' in 腔:
			表 = self.四縣表
		elif '海陸腔' in 腔:
			表 = self.海陸表
		elif '大埔腔' in 腔:
			表 = self.大埔表
		elif '饒平腔' in 腔:
			表 = self.饒平表
		elif '詔安腔' in 腔:
			表 = self.詔安表
		else:
			raise RuntimeError('腔口毋著：{0}'.format(腔))
		return self.查表數字轉調號(音, 表)
	def 查表數字轉調號(self, 音, 表):
		for 舊, 新 in 表:
			音 = 音.replace(舊, 新)
		return 音
