# -*- coding: utf-8 -*-
from 臺灣言語工具.音標系統.閩南語.臺灣閩南語羅馬字拼音 import 臺灣閩南語羅馬字拼音聲母表
from 臺灣言語工具.音標系統.閩南語.臺灣閩南語羅馬字拼音 import 臺灣閩南語羅馬字拼音韻母表
from 臺灣言語工具.音標系統.閩南語.臺灣閩南語羅馬字拼音 import 臺灣閩南語羅馬字拼音
from 臺灣言語工具.音標系統.閩南語.臺灣閩南語羅馬字拼音轉音值模組 import 臺灣閩南語羅馬字拼音對照音值聲母表
from 臺灣言語工具.音標系統.閩南語.臺灣閩南語羅馬字拼音轉音值模組 import 臺灣閩南語羅馬字拼音對照音值韻母表
from 臺灣言語工具.語音辨識.生文本音值對照表 import 生文本音值對照表


class 閩南語文本音值表:
    _文本音值對照表 = 生文本音值對照表()

    @classmethod
    def 音節佮聲韻對照(cls):
        return cls._文本音值對照表.生音節佮聲韻對照(臺灣閩南語羅馬字拼音, 臺灣閩南語羅馬字拼音聲母表, 臺灣閩南語羅馬字拼音韻母表)

    @classmethod
    def 聲韻表(cls):
        return cls._文本音值對照表.生聲韻表(臺灣閩南語羅馬字拼音對照音值聲母表, 臺灣閩南語羅馬字拼音對照音值韻母表)

if __name__ == '__main__':
    文本音值表 = 閩南語文本音值表()
    print('\n'.join(文本音值表.音節佮聲韻對照()), file=open('閩南語聲韻對照.dict', 'w'))
    print('\n'.join(文本音值表.聲韻表()), file=open('閩南語聲韻表.dict', 'w'))
