import unittest
from 字詞組集句章.解析整理工具.拆文分析器 import 拆文分析器
from 字詞組集句章.解析整理工具.文章初胚工具 import 文章初胚工具
from 字詞組集句章.基本元素.集 import 集
from 字詞組集句章.基本元素.句 import 句
from 字詞組集句章.綜合標音.句綜合標音 import 句綜合標音
from 字詞組集句章.綜合標音.閩南語字綜合標音 import 閩南語字綜合標音
from 字詞組集句章.綜合標音.集綜合標音 import 集綜合標音

class 句綜合標音測試(unittest.TestCase):
	def setUp(self):
		self.分析器 = 拆文分析器()
		self.初胚工具 = 文章初胚工具()
	def tearDown(self):
		pass
	def test_基本測試(self):
		我 = self.分析器.產生對齊集('我', 'gua2')
		愛 = self.分析器.產生對齊集('愛', 'ai3')
		媠某 = self.分析器.產生對齊組('美女', 'sui2-boo2')
		美女 = self.分析器.產生對齊組('美女', 'mi2-lu2')
		莉 = 集([媠某, 美女])
		句物件 = 句([我, 愛, 莉])
		標音句 = 句綜合標音(閩南語字綜合標音, 句物件)
		self.assertEqual(len(標音句.綜合集), 3)
		self.assertEqual(len(標音句.綜合集[0].綜合詞組), 1)
		self.assertEqual(len(標音句.綜合集[1].綜合詞組), 1)
		self.assertEqual(len(標音句.綜合集[2].綜合詞組), 2)
		self.assertEqual(len(標音句.綜合集), 3)
		self.assertEqual(標音句.綜合集[0], 集綜合標音(閩南語字綜合標音, 我))
		self.assertEqual(標音句.綜合集[1], 集綜合標音(閩南語字綜合標音, 愛))
		self.assertEqual(標音句.綜合集[2], 集綜合標音(閩南語字綜合標音, 莉))
		
	def test_一句無連字轉json格式(self):
		句物件 = self.分析器.產生對齊句('點仔膠，黏著跤，', 'tiam2 a2 ka1, liam5 tioh8 kha1,')
		標音句 = 句綜合標音(閩南語字綜合標音, 句物件)
		self.assertEqual(標音句.轉json格式(), [[{'詞組綜合標音': [
			{'通用數字調': 'diam4', '吳守禮方音': '⿳⿳⿳ㄉㄧㆰˋ', '臺羅閏號調': 'tiám', '臺羅數字調': 'tiam2', '型體': '點'},
			{'通用數字調': 'a4', '吳守禮方音': '⿳ㄚˋ', '臺羅閏號調': 'á', '臺羅數字調': 'a2', '型體': '仔'},
			{'通用數字調': 'ga1', '吳守禮方音': '⿳ㄍㄚ', '臺羅閏號調': 'ka', '臺羅數字調': 'ka1', '型體': '膠'},
			{'通用數字調': ',', '吳守禮方音': '', '臺羅閏號調': ',', '臺羅數字調': ',', '型體': '，'},
			{'通用數字調': 'liam5', '吳守禮方音': '⿳⿳⿳ㄌㄧㆰˊ', '臺羅閏號調': 'liâm', '臺羅數字調': 'liam5', '型體': '黏'},
			{'通用數字調': 'diorh6', '吳守禮方音': '⿳⿳⿳⿳ㄉㄧㄜ㆐ㆷ', '臺羅閏號調': 'tio̍h', '臺羅數字調': 'tioh8', '型體': '著'},
			{'通用數字調': 'ka1', '吳守禮方音': '⿳ㄎㄚ', '臺羅閏號調': 'kha', '臺羅數字調': 'kha1', '型體': '跤'},
			{'通用數字調': ',', '吳守禮方音': '', '臺羅閏號調': ',', '臺羅數字調': ',', '型體': '，'}
			], '連字音': 'tiam2 a2 ka1 , liam5 tioh8 kha1 ,'}]])
		
	def test_一句連字轉json格式(self):
		句物件 = self.分析器.產生對齊句('點仔膠，黏著跤，', 'tiam2-a2-ka1, liam5-tioh8 kha1,')
		標音句 = 句綜合標音(閩南語字綜合標音, 句物件)
		self.assertEqual(標音句.轉json格式(), [[{'詞組綜合標音': [
			{'通用數字調': 'diam4', '吳守禮方音': '⿳⿳⿳ㄉㄧㆰˋ', '臺羅閏號調': 'tiám', '臺羅數字調': 'tiam2', '型體': '點'},
			{'通用數字調': 'a4', '吳守禮方音': '⿳ㄚˋ', '臺羅閏號調': 'á', '臺羅數字調': 'a2', '型體': '仔'},
			{'通用數字調': 'ga1', '吳守禮方音': '⿳ㄍㄚ', '臺羅閏號調': 'ka', '臺羅數字調': 'ka1', '型體': '膠'},
			{'通用數字調': ',', '吳守禮方音': '', '臺羅閏號調': ',', '臺羅數字調': ',', '型體': '，'},
			{'通用數字調': 'liam5', '吳守禮方音': '⿳⿳⿳ㄌㄧㆰˊ', '臺羅閏號調': 'liâm', '臺羅數字調': 'liam5', '型體': '黏'},
			{'通用數字調': 'diorh6', '吳守禮方音': '⿳⿳⿳⿳ㄉㄧㄜ㆐ㆷ', '臺羅閏號調': 'tio̍h', '臺羅數字調': 'tioh8', '型體': '著'},
			{'通用數字調': 'ka1', '吳守禮方音': '⿳ㄎㄚ', '臺羅閏號調': 'kha', '臺羅數字調': 'kha1', '型體': '跤'},
			{'通用數字調': ',', '吳守禮方音': '', '臺羅閏號調': ',', '臺羅數字調': ',', '型體': '，'}
			], '連字音': 'tiam2-a2-ka1 , liam5-tioh8 kha1 ,'}]])
		
	def test_一句濟詞無連字轉json格式(self):
		句物件 = 句([
			self.分析器.產生對齊集('點', 'tiam2'),
			self.分析器.產生對齊集('仔', 'a2'),
			self.分析器.產生對齊集('膠', 'ka1'),
			self.分析器.產生對齊集('，', ','),
			self.分析器.產生對齊集('黏', 'liam5'),
			self.分析器.產生對齊集('著', 'tioh8'),
			self.分析器.產生對齊集('跤', 'kha1'),
			self.分析器.產生對齊集('，', ',')])
		標音句 = 句綜合標音(閩南語字綜合標音, 句物件)
		self.assertEqual(標音句.轉json格式(), [
			[{"詞組綜合標音":[
				{"型體":"點", "臺羅數字調":"tiam2", "臺羅閏號調":"tiám", "通用數字調":"diam4", "吳守禮方音":"⿳⿳⿳ㄉㄧㆰˋ"}],
			"連字音":"tiam2"}],
			[{"詞組綜合標音":[
				{"型體":"仔", "臺羅數字調":"a2", "臺羅閏號調":"á", "通用數字調":"a4", "吳守禮方音":"⿳ㄚˋ"}],
			"連字音":"a2"}],
			[{"詞組綜合標音":[
				{"型體":"膠", "臺羅數字調":"ka1", "臺羅閏號調":"ka", "通用數字調":"ga1", "吳守禮方音":"⿳ㄍㄚ"}],
			"連字音":"ka1"}],
			[{"詞組綜合標音":[
				{"型體":"，", "臺羅數字調":",", "臺羅閏號調":",", "通用數字調":",", "吳守禮方音":""}],
			"連字音":","}],
			[{"詞組綜合標音":[
				{"型體":"黏", "臺羅數字調":"liam5", "臺羅閏號調":"liâm", "通用數字調":"liam5", "吳守禮方音":"⿳⿳⿳ㄌㄧㆰˊ"}],
			"連字音":"liam5"}],
			[{"詞組綜合標音":[
				{"型體":"著", "臺羅數字調":"tioh8", "臺羅閏號調":"tio̍h", "通用數字調":"diorh6", "吳守禮方音":"⿳⿳⿳⿳ㄉㄧㄜ㆐ㆷ"}],
			"連字音":"tioh8"}],
			[{"詞組綜合標音":[
				{"型體":"跤", "臺羅數字調":"kha1", "臺羅閏號調":"kha", "通用數字調":"ka1", "吳守禮方音":"⿳ㄎㄚ"}],
			"連字音":"kha1"}],
			[{"詞組綜合標音":[
				{"型體":"，", "臺羅數字調":",", "臺羅閏號調":",", "通用數字調":",", "吳守禮方音":""}],
			"連字音":","}]
			])
		
	def test_一句濟詞連字轉json格式(self):
		句物件 = 句([
			self.分析器.產生對齊集('點仔膠', 'tiam2-a2-ka1'),
			self.分析器.產生對齊集('，', ','),
			self.分析器.產生對齊集('黏著', 'liam5-tioh8'),
			self.分析器.產生對齊集('跤', 'kha1'),
			self.分析器.產生對齊集('，', ',')
			])
		標音句 = 句綜合標音(閩南語字綜合標音, 句物件)
		self.assertEqual(標音句.轉json格式(), [
			[{"詞組綜合標音":[
				{"型體":"點", "臺羅數字調":"tiam2", "臺羅閏號調":"tiám", "通用數字調":"diam4", "吳守禮方音":"⿳⿳⿳ㄉㄧㆰˋ"},
				{"型體":"仔", "臺羅數字調":"a2", "臺羅閏號調":"á", "通用數字調":"a4", "吳守禮方音":"⿳ㄚˋ"},
				{"型體":"膠", "臺羅數字調":"ka1", "臺羅閏號調":"ka", "通用數字調":"ga1", "吳守禮方音":"⿳ㄍㄚ"}
				],
			"連字音":"tiam2-a2-ka1"}],
			[{"詞組綜合標音":[
				{"型體":"，", "臺羅數字調":",", "臺羅閏號調":",", "通用數字調":",", "吳守禮方音":""}],
			"連字音":","}],
			[{"詞組綜合標音":[
				{"型體":"黏", "臺羅數字調":"liam5", "臺羅閏號調":"liâm", "通用數字調":"liam5", "吳守禮方音":"⿳⿳⿳ㄌㄧㆰˊ"},
				{"型體":"著", "臺羅數字調":"tioh8", "臺羅閏號調":"tio̍h", "通用數字調":"diorh6", "吳守禮方音":"⿳⿳⿳⿳ㄉㄧㄜ㆐ㆷ"}
				],
			"連字音":"liam5-tioh8"}],
			[{"詞組綜合標音":[
				{"型體":"跤", "臺羅數字調":"kha1", "臺羅閏號調":"kha", "通用數字調":"ka1", "吳守禮方音":"⿳ㄎㄚ"}],
			"連字音":"kha1"}],
			[{"詞組綜合標音":[
				{"型體":"，", "臺羅數字調":",", "臺羅閏號調":",", "通用數字調":",", "吳守禮方音":""}],
			"連字音":","}]
			])
	def test_食章物件(self):
		self.assertEqual(1, 2)

if __name__ == '__main__':
	unittest.main()
