import unittest
from 單一功能.字詞組集句章.解析整理工具.文章初胚工具測試 import 拆文初胚工具測試
from 單一功能.字詞組集句章.解析整理工具.拆文分析器測試 import 拆文分析器測試
from 單一功能.字詞組集句章.解析整理工具.轉物件音家私測試 import 轉物件音家私測試
from 單一功能.字詞組集句章.解析整理工具.物件譀鏡測試 import 物件譀鏡測試
from 單一功能.字詞組集句章.解析整理工具.字物件篩仔測試 import 字物件篩仔測試
from 單一功能.字詞組集句章.解析整理工具.集內組照排測試 import 集內組照排測試
from 單一功能.字詞組集句章.音標轉換.臺灣語言音標測試 import 臺灣語言音標測試
from 單一功能.字詞組集句章.音標轉換.臺灣閩南語羅馬字拼音測試 import 臺灣閩南語羅馬字拼音測試
from 單一功能.字詞組集句章.音標轉換.方音符號吳守禮改良式模組測試 import 臺灣閩南語羅馬字拼音模組測試
from 單一功能.字詞組集句章.音標轉換.通用拼音音標測試 import 通用拼音音標測試
from 單一功能.字詞組集句章.綜合標音.句綜合標音測試 import 句綜合標音測試
from 單一功能.字詞組集句章.綜合標音.集綜合標音測試 import 集綜合標音測試
from 單一功能.字詞組集句章.綜合標音.詞組綜合標音測試 import 詞組綜合標音測試
from 單一功能.字詞組集句章.綜合標音.閩南語字綜合標音測試 import 閩南語字綜合標音測試
from 單一功能.字詞組集句章.綜合標音.客話字綜合標音測試 import 客話字綜合標音測試
from 單一功能.字詞組集句章.綜合標音.國語字綜合標音測試 import 國語字綜合標音測試
from 單一功能.斷詞標音.型音辭典測試 import 型音辭典測試
from 單一功能.斷詞標音.現掀辭典測試 import 現掀辭典測試
from 單一功能.斷詞標音.動態規劃斷詞標音測試 import 動態規劃斷詞標音測試
# from 單一功能.剖析工具.剖析工具測試 import 剖析工具測試

if __name__ == '__main__':
	拆文初胚工具測試
	拆文分析器測試
	轉物件音家私測試
	物件譀鏡測試
	字物件篩仔測試
	集內組照排測試
	
	臺灣語言音標測試
	臺灣閩南語羅馬字拼音測試
	臺灣閩南語羅馬字拼音模組測試
	通用拼音音標測試
	
	句綜合標音測試
	集綜合標音測試
	詞組綜合標音測試
	閩南語字綜合標音測試
	客話字綜合標音測試
	國語字綜合標音測試
	
	型音辭典測試
	現掀辭典測試
	動態規劃斷詞標音測試

# 	剖析工具測試
	unittest.main()
