from 言語資料庫.公用資料 import 資料庫連線

型體翻譯 = lambda 原來腔口, 型態, 欲揣腔口:資料庫連線.prepare('SELECT ' +
	'"寅"."流水號","寅"."來源","寅"."種類","寅"."腔口","寅"."地區","寅"."年代",'+
	'"寅"."組合","寅"."型體","寅"."音標","寅"."調變","寅"."音變" ' +
	'FROM "言語"."文字" AS "子", "言語"."關係" AS "丑", "言語"."文字" AS "寅" ' +
	' WHERE "子"."腔口"=$1 AND "子"."型體"=$2 AND ' +
	'"丑"."甲流水號"="子"."流水號" AND "丑"."乙流水號"="寅"."流水號" AND "丑"."乙對甲的關係類型"=\'義近\' AND ' +
	'"寅"."腔口"=$3 '
	'ORDER BY "寅"."流水號"')(原來腔口, 型態, 欲揣腔口)

型體翻譯 = lambda 原來腔口, 型態, 欲揣腔口:資料庫連線.prepare('SELECT ' +
	'"寅"."流水號","寅"."來源","寅"."種類","寅"."腔口","寅"."地區","寅"."年代",'+
	'"寅"."組合","寅"."型體","寅"."音標","寅"."調變","寅"."音變" ' +
	'FROM "言語"."文字" AS "子", "言語"."關係" AS "丑", "言語"."文字" AS "寅" ' +
	' WHERE "子"."腔口"=$1 AND "子"."型體"=$2 AND ' +
	'"丑"."乙流水號"="子"."流水號" AND "丑"."甲流水號"="寅"."流水號" AND "丑"."乙對甲的關係類型"=\'義近\' AND ' +
	'"寅"."腔口"=$3 '
	'ORDER BY "寅"."流水號"')(原來腔口, 型態, 欲揣腔口)

if __name__ == '__main__':
	print(型體翻譯('漢語族官話方言北京官話臺灣腔', '一朵花', '漢語族閩方言閩南語偏漳優勢音'))


