from 字詞組集句章.解析整理工具.拆文分析器 import 拆文分析器
from 字詞組集句章.解析整理工具.文章初胚工具 import 文章初胚工具
from 字詞組集句章.音標系統.閩南語.通用拼音音標 import 通用拼音音標
from 字詞組集句章.解析整理工具.解析錯誤 import 解析錯誤
from 字詞組集句章.解析整理工具.轉物件音家私 import 轉物件音家私
class 第四步建立句物件:
	初胚工具 = 文章初胚工具()
	分析器 = 拆文分析器()
	家私=轉物件音家私()
	def 建立(self, 語句):
		資料 = []
		for 句 in 語句:
			資料.append(self.建立一句(句))
		return 資料
	def 建立一句(self, 句):
		(標籤, 漢羅, 音標) = 句
		try:
			減號了音 = self.初胚工具.建立物件語句前處理減號(通用拼音音標, 音標)
# 			句物件=self.分析器.產生對齊句(漢羅, 減號了音)
			句物件 = self.分析器.產生對齊句(音標, 減號了音)
		except (解析錯誤) as 錯誤:
# 			print("漢羅佮拼音無法度對齊！！{0}".format(錯誤))
			return (標籤, None)
		try:
			臺羅句物件=self.家私.句轉做標準音標(通用拼音音標, 句物件)
# 			句物件=self.分析器.產生對齊句(漢羅, 減號了音)
		except (解析錯誤) as 錯誤:
			print("音標有問題！！{0}".format(錯誤))
			return (標籤, None)
		return (標籤, 臺羅句物件)
