"""
著作權所有 (C) 民國102年 意傳文化科技
開發者：薛丞宏
網址：http://意傳.台灣
語料來源：請看各資料庫內說明

本程式乃自由軟體，您必須遵照SocialCalc設計的通用公共授權（Common Public Attribution License, CPAL)來修改和重新發佈這一程式，詳情請參閱條文。授權大略如下，若有歧異，以授權原文為主：
	１．得使用、修改、複製並發佈此程式碼，且必須以通用公共授權發行；
	２．任何以程式碼衍生的執行檔或網路服務，必須公開該程式碼；
	３．將此程式的原始碼當函式庫引用入商業軟體，且不需公開非關此函式庫的任何程式碼

此開放原始碼、共享軟體或說明文件之使用或散佈不負擔保責任，並拒絕負擔因使用上述軟體或說明文件所致任何及一切賠償責任或損害。

臺灣言語工具緣起於本土文化推廣與傳承，非常歡迎各界用於商業軟體，但希望在使用之餘，能夠提供建議、錯誤回報或修補，回饋給這塊土地。

感謝您的使用與推廣～～勞力！承蒙！
"""
from 資料庫.資料庫連線 import 資料庫連線
import xlrd

class 數位典藏文本段落轉逝:
	到逝=True
	揣數位典藏文本段資料庫 = 資料庫連線.prepare('SELECT "id","檔案名","漢羅","全羅","漢羅逝","全羅逝" '+
		'FROM "台語文數位典藏"."改過段落資料" ' +
		'WHERE LOWER("檔案名") LIKE LOWER($1)')
# 	揣數位典藏文本段資料庫 = 資料庫連線.prepare('SELECT "id","檔案名" '+
# 		'FROM "台語文數位典藏"."改過段落資料" ' +
# 		'WHERE LOWER("檔案名") LIKE LOWER($1)')
	插入台語數位典藏文本資料庫 = 資料庫連線.prepare('INSERT INTO "台語文數位典藏"."原始逝資料" ' +
		'("流水號","時代","年","類","類二","漢羅標","全羅標","漢羅名","全羅名","檔案名","漢羅文","全羅文","漢羅逝","全羅逝") '+
		'VALUES ($1,$2,$3,$4,$5,$6,$7,$8,$9,$10,$11,$12,$13,$14)')
	插入修改數位典藏文本資料庫 = 資料庫連線.prepare('INSERT INTO "台語文數位典藏"."改過逝資料" ' +
		'("流水號","時代","年","類","類二","漢羅標","全羅標","漢羅名","全羅名","檔案名","漢羅文","全羅文","漢羅逝","全羅逝") '+
		'VALUES ($1,$2,$3,$4,$5,$6,$7,$8,$9,$10,$11,$12,$13,$14)')
	目錄檔='/dev/shm/pbk.xls'
	def __init__(self):
		表格檔=xlrd.open_workbook(self.目錄檔)
		for 表格名 in 表格檔.sheet_names():
			表格=表格檔.sheet_by_name(表格名)
			print(表格.row_values(0))
			段落流水號={}
			狀況={}
			for 第幾逝 in range(1,表格.nrows):
				資料=表格.row_values(第幾逝)
				if 資料[-1] == 'XXX':
					continue
				目錄流水號,全羅標,漢羅標,年,全羅名,漢羅名,時代,類,類二=資料[:9]
				目錄流水號=int(目錄流水號)
				if isinstance(年, float):
					年=int(年)
				if isinstance(年, int):
					年=str(年)
				
				#{0: 649, 1: 1505, 2: 8, 4: 1}
				#L{1: 2149, 2: 11, 3: 2, 5: 1}//段落流水號1:2139 2:16
				可能檔名='%{0}%{1}%{2}%{3}%{4}%{5}%'.format(時代,年,類,年,全羅名,全羅標)
				
				#{0: 11, 1: 2138, 2: 12, 3: 1, 4: 1}
				#L{1: 2147, 2: 13, 3: 2, 5: 1}
# 				可能檔名='%{0}%{1}%{2}%'.format(年,全羅名,全羅標)

				#L{1: 2156, 2: 6, 3: 1}
				可能檔名='%{0}%{1}%{2}%{3}%{4}%{5}.%'.format(時代,年,類,年,全羅名,全羅標)
				#L{1: 2163}
				可能檔名='%{0}%{1}%{2}%{3}%{4}.{5}.%'.format(時代,年,類,年,全羅名,全羅標)
				#{0: 11, 1: 2152}
# 				可能檔名='%{0}%{1}%%{3}%{4}.{5}.%'.format(時代,年,類,年,全羅名,全羅標)

				段資料=list(self.揣數位典藏文本段資料庫(可能檔名))
				for 段 in 段資料:
					段流水號=段[0]
					if 段流水號 not in 段落流水號:
						段落流水號[段流水號]=0
					段落流水號[段流水號]+=1
				
				新狀況=len(段資料)
				if 新狀況 not in 狀況:
					狀況[新狀況]=0
				狀況[新狀況]+=1
				if 新狀況!=1:
					print(目錄流水號,可能檔名)
					print(新狀況,段資料)
					
				if self.到逝:
					段流水號,檔案名,漢羅文,全羅文,漢羅逝,全羅逝=段資料[0]
# 					流水號","時代","年","類","類二","漢羅標","全羅標","漢羅名","全羅名","檔案名","漢羅文","全羅文","漢羅逝","全羅逝
					if '<BR>' in 漢羅文 or '<BR>' in 全羅文 or '<br>' in 漢羅文 or '<br>' in 全羅文:
						漢羅文=漢羅文.replace('\n','\n\n').replace('<BR>','\n').replace('<br>','\n')
						全羅文=全羅文.replace('\n','\n\n').replace('<BR>','\n').replace('<br>','\n')
					漢羅文=漢羅文.strip().split('\n')
					全羅文=全羅文.strip().split('\n')
					for 所在 in range(len(漢羅文)):
						漢羅文[所在]=漢羅文[所在].strip()
					for 所在 in range(len(全羅文)):
						全羅文[所在]=全羅文[所在].strip()
					漢羅逝,全羅逝=len(漢羅文),len(全羅文)
					漢羅文='\n'.join(漢羅文)
					全羅文='\n'.join(全羅文)
# 					目錄流水號,全羅標,漢羅標,年,全羅名,漢羅名,時代,類,類二=資料[:9]
# 					print(目錄流水號,時代,年,類,類二,漢羅標,全羅標,漢羅名,全羅名,檔案名,漢羅文,全羅文,漢羅逝,全羅逝)
# 					print(目錄流水號,時代,年,類,類二,漢羅標,全羅標,漢羅名,全羅名,檔案名,漢羅逝,全羅逝)
					self.插入台語數位典藏文本資料庫(目錄流水號,時代,年,類,類二,漢羅標,全羅標,漢羅名,全羅名,檔案名,漢羅文,全羅文,漢羅逝,全羅逝)
					self.插入修改數位典藏文本資料庫(目錄流水號,時代,年,類,類二,漢羅標,全羅標,漢羅名,全羅名,檔案名,漢羅文,全羅文,漢羅逝,全羅逝) 
			print(狀況)
			print(段落流水號)
			print(len(段落流水號))
			for 號 in range(2,2171):
				if 號 not in 段落流水號:
					print('無：',號)
			for 號 in range(2,2171):
				if 號 not in 段落流水號:
					pass
				elif 段落流水號[號]>1:
					print('二个以上：',號)

if __name__ == '__main__':
	數位典藏文本段落轉逝()
