"""
著作權所有 (C) 民國102年 意傳文化科技
開發者：薛丞宏
網址：http://意傳.台灣
語料來源：請看各資料庫內說明

本程式乃自由軟體，您必須遵照SocialCalc設計的通用公共授權（Common Public Attribution License, CPAL)來修改和重新發佈這一程式，詳情請參閱條文。授權大略如下，若有歧異，以授權原文為主：
	１．得使用、修改、複製並發佈此程式碼，且必須以通用公共授權發行；
	２．任何以程式碼衍生的執行檔或網路服務，必須公開該程式碼；
	３．將此程式的原始碼當函式庫引用入商業軟體，且不需公開非關此函式庫的任何程式碼

此開放原始碼、共享軟體或說明文件之使用或散佈不負擔保責任，並拒絕負擔因使用上述軟體或說明文件所致任何及一切賠償責任或損害。

臺灣言語工具緣起於本土文化推廣與傳承，非常歡迎各界用於商業軟體，但希望在使用之餘，能夠提供建議、錯誤回報或修補，回饋給這塊土地。

感謝您的使用與推廣～～勞力！承蒙！
"""
文字 = '文字'
關係 = '關係'
演化 = '演化'

文字組合符號 = ','
文字組合邊界 = '#'

字詞 = '字詞'
語句 = '語句'
章表冊 = '章表冊'

會當替換 = '會當替換'
袂當替換 = '袂當替換'
義近 = '義近'
義倒 = '義倒'

# 臺語腔口 = '漢語族閩方言閩南語'
閩南語 = '漢語族閩方言閩南語'
國語臺員腔 = '漢語族官話方言北京官話臺灣腔'
臺員 = '臺員'
客語 = '漢語族客家方言'

偏漳優勢音腔口 = 閩南語 + '偏漳腔'
偏泉優勢音腔口 = 閩南語 + '偏泉腔'
混合優勢音腔口 = 閩南語 + '混合腔'

四縣腔 = 客語 + '四縣腔'
海陸腔 = 客語 + '海陸腔'
大埔腔 = 客語 + '大埔腔'
饒平腔 = 客語 + '饒平腔'
詔安腔 = 客語 + '詔安腔'

版本正常 = '正常'
版本音標有問題 = '音標有問題'
