# -*- coding: utf-8 -*-
import unittest
from unittest.mock import patch, call


from 臺灣言語工具.語音合成.語音標仔轉換 import 語音標仔轉換
from 臺灣言語工具.音標系統.閩南語.臺灣閩南語羅馬字拼音 import 臺灣閩南語羅馬字拼音
from 臺灣言語工具.音標系統.客話.臺灣客家話拼音 import 臺灣客家話拼音
from 臺灣言語工具.解析整理.拆文分析器 import 拆文分析器
from 臺灣言語工具.解析整理.轉物件音家私 import 轉物件音家私


class 南島語語音標仔轉換單元試驗(TestCase):

    def test_海岸阿美(self):
        句物件 = 拆文分析器.對齊句物件(self.閩南語, self.閩南語)
        音值句物件 = 轉物件音家私.轉音(臺灣閩南語羅馬字拼音, 句物件, 函式='音值')
        完整標仔 = 語音標仔轉換.物件轉完整合成標仔(音值句物件)
        [['ŋ', 'a'], ['ʔ', 'a', 'y']], [['h', 'u']]
        self.檢驗標仔有對無(完整標仔, [
            'x-sil+x/調:x<x>x/詞:x!x@x/句:x^x_x',
            'sil-ŋ+a/調:x<x>x/詞:0!4@5/句:0^1_2',
            'ŋ-a+ʔ/調:x<x>x/詞:1!3@5/句:0^1_2',
            'a-ʔ+a/調:x<x>x/詞:2!2@5/句:0^1_2',
            'ʔ-a+y/調:x<x>x/詞:3!1@5/句:0^1_2',
            'a-y+h/調:x<x>x/詞:4!0@5/句:0^1_2',
            'y-h+u/調:x<x>x/詞:0!1@2/句:1^0_2',
            'h-u+sil/調:x<x>x/詞:1!0@2/句:1^0_2',
            'x-sil+x/調:x<x>x/詞:x!x@x/句:x^x_x',
        ])
    def test_有標點符號的無音(self):
        句物件 = 拆文分析器.對齊句物件(self.閩南語, self.閩南語)
        音值句物件 = 轉物件音家私.轉音(臺灣閩南語羅馬字拼音, 句物件, 函式='音值')
        完整標仔 = 語音標仔轉換.物件轉完整合成標仔(音值句物件)
        [['ŋ', 'a'], ['ʔ', 'a', 'y']], [['h', 'u']], ''
        self.檢驗標仔有對無(完整標仔, [
            'x-sil+x/調:x<x>x/詞:x!x@x/句:x^x_x',
            'sil-ŋ+a/調:x<x>x/詞:0!4@/句:0^2_3',
            'ŋ-a+ʔ/調:x<x>x/詞:1!3@/句:0^2_3',
            'a-ʔ+a/調:x<x>x/詞:2!2@/句:0^2_3',
            'ʔ-a+y/調:x<x>x/詞:3!1@/句:0^2_3',
            'a-y+h/調:x<x>x/詞:4!0@/句:0^2_3',
            'y-h+u/調:x<x>x/詞:0!1@/句:1^1_3',
            'h-u+sil/調:x<x>x/詞:1!0@/句:1^1_3',
            'x-sil+x/調:x<x>x/詞:x!x@x/句:x^x_x',
            'x-sil+x/調:x<x>x/詞:x!x@x/句:x^x_x',
        ])
