# -*- coding: utf-8 -*-
import unittest


from 臺灣言語工具.語音合成.閩南語變調 import 閩南語變調
from 臺灣言語工具.解析整理.拆文分析器 import 拆文分析器
from 臺灣言語工具.解析整理.字物件篩仔 import 字物件篩仔
from 臺灣言語工具.基本物件.句 import 句
from 臺灣言語工具.基本物件.章 import 章
from 臺灣言語工具.解析整理.解析錯誤 import 解析錯誤


class 閩南語變調單元試驗(unittest.TestCase):

    def test_句尾變調(self):
        原本 = 拆文分析器.建立句物件('我愛媠媠')
        self._設定音值(原本,
                   [('g', 'ua', '2'), ('ʔ', 'ai', '3'), ('s', 'ui', '2'), ('s', 'ui', '2')])
        變調了 = 拆文分析器.建立句物件('我愛媠媠')
        self._設定音值(變調了,
                   [('g', 'ua', '1'), ('ʔ', 'ai', '2'), ('s', 'ui', '1'), ('s', 'ui', '2')])
        self.assertEqual(閩南語變調.變調(原本), 變調了)

    def test_句尾變調原本物件無變(self):
        原本 = 拆文分析器.建立句物件('我愛媠媠')
        self._設定音值(原本,
                   [('g', 'ua', '2'), ('ʔ', 'ai', '3'), ('s', 'ui', '2'), ('s', 'ui', '2')])
        原本物件 = 句(原本.內底集)
        閩南語變調.變調(原本)
        self.assertEqual(原本, 原本物件)

    def test_喉入聲(self):
        原本 = 拆文分析器.建立句物件('khah4 ho2')
        self._設定音值(原本, [('kh', 'ah', '4'), ('h', 'o', '2')])
        變調了 = 拆文分析器.建立句物件('khah4 ho2')
        self._設定音值(變調了, [('kh', 'a', '2'), ('h', 'o', '2')])
        self.assertEqual(閩南語變調.變調(原本), 變調了)

    def test_ptk入聲(self):
        原本 = 拆文分析器.建立句物件('kut4-thau5 kut8-kut8')
        self._設定音值(原本, [
            ('k', 'ut', '4'), ('th', 'au', '5'),
            ('k', 'ut', '8'), ('k', 'ut', '8')
        ])
        變調了 = 拆文分析器.建立句物件('kut4-thau5 kut8-kut8')
        self._設定音值(變調了, [
            ('k', 'ut', '8'), ('th', 'au', '7'),
            ('k', 'ut', '10'), ('k', 'ut', '8')
        ])
        self.assertEqual(閩南語變調.變調(原本), 變調了)

    def test_仝詞攏輕聲(self):
        原本 = 拆文分析器.建立句物件('gua2 ai3 0sui2-sui2')
        self._設定音值(原本,
                   [('g', 'ua', '2'), ('ʔ', 'ai', '3'), ('s', 'ui', '0'), ('s', 'ui', '2')])
        變調了 = 拆文分析器.建立句物件('gua2 ai3 0sui2-sui2')
        self._設定音值(變調了,
                   [('g', 'ua', '1'), ('ʔ', 'ai', '2'), ('s', 'ui', '0'), ('s', 'ui', '0')])
        self.assertEqual(閩南語變調.變調(原本), 變調了)

    def test_無合法的音標愛錯誤(self):
        with self.assertRaises(解析錯誤):
            閩南語變調.實詞變調('g', 'ua', '4')
        with self.assertRaises(解析錯誤):
            閩南語變調.實詞變調('g', 'uah', '2')
        with self.assertRaises(解析錯誤):
            閩南語變調.實詞變調('g', 'uat', '2')

    def test_的前無變調(self):
        原本 = 拆文分析器.建立句物件('我上愛媠媠的姑娘')
        self._設定音值(原本,
                   [('g', 'ua', '2'), ('s', 'ioŋ', '7'), ('ʔ', 'ai', '3'),
                    ('s', 'ui', '2'), ('s', 'ui', '2'), ('ʔ', 'e', '5'), ('k', 'o', '1'), ('n', 'iu', '5')])
        變調了 = 拆文分析器.建立句物件('我上愛媠媠的姑娘')
        self._設定音值(變調了,
                   [('g', 'ua', '1'), ('s', 'ioŋ', '3'), ('ʔ', 'ai', '2'),
                    ('s', 'ui', '1'), ('s', 'ui', '2'), ('ʔ', 'e', '7'), ('k', 'o', '7'), ('n', 'iu', '5')])
        self.assertEqual(閩南語變調.變調(原本), 變調了)

    def test_的前無變調原本物件無變(self):
        原本 = 拆文分析器.建立句物件('我上愛媠媠的姑娘')
        self._設定音值(原本,
                   [('g', 'ua', '2'), ('s', 'ioŋ', '7'), ('ʔ', 'ai', '3'),
                    ('s', 'ui', '2'), ('s', 'ui', '2'), ('ʔ', 'e', '5'), ('k', 'o', '1'), ('n', 'iu', '5')])
        原本物件 = 句(原本.內底集)
        閩南語變調.變調(原本)
        self.assertEqual(原本, 原本物件)

    def test_的前代名詞變調(self):
        原本 = 拆文分析器.建立句物件('我的媠媠')
        self._設定音值(原本,
                   [('g', 'ua', '2'), ('ʔ', 'e', '5'),
                    ('s', 'ui', '2'), ('s', 'ui', '2'), ])
        變調了 = 拆文分析器.建立句物件('我的媠媠')
        self._設定音值(變調了,
                   [('g', 'ua', '1'), ('ʔ', 'e', '7'),
                    ('s', 'ui', '1'), ('s', 'ui', '2'), ])
        self.assertEqual(閩南語變調.變調(原本), 變調了)

    def test_的前代名詞變調原本物件無變(self):
        原本 = 拆文分析器.建立句物件('我的媠媠')
        self._設定音值(原本,
                   [('g', 'ua', '2'), ('ʔ', 'e', '5'),
                    ('s', 'ui', '2'), ('s', 'ui', '2'), ])
        原本物件 = 句(原本.內底集)
        閩南語變調.變調(原本)
        self.assertEqual(原本, 原本物件)

    def test_井前無變調(self):
        原本 = 拆文分析器.建立句物件('我#愛媠媠')
        self._設定音值(原本,
                   [('g', 'ua', '2'), (None,), ('ʔ', 'ai', '3'), ('s', 'ui', '2'), ('s', 'ui', '2')])
        變調了 = 拆文分析器.建立句物件('我#愛媠媠')
        self._設定音值(變調了,
                   [('g', 'ua', '2'), (None,), ('ʔ', 'ai', '2'), ('s', 'ui', '1'), ('s', 'ui', '2')])
        self.assertEqual(閩南語變調.變調(原本), 變調了)

    def test_井前無變調原本物件無變(self):
        原本 = 拆文分析器.建立句物件('我#愛媠媠')
        self._設定音值(原本,
                   [('g', 'ua', '2'), (None,), ('ʔ', 'ai', '3'), ('s', 'ui', '2'), ('s', 'ui', '2')])
        原本物件 = 句(原本.內底集)
        閩南語變調.變調(原本)
        self.assertEqual(原本, 原本物件)

    def test_章物件句尾變調(self):
        原本 = 拆文分析器.建立章物件('我愛媠媠。我愛媠媠。')
        self._設定音值(原本,
                   [('g', 'ua', '2'), ('ʔ', 'ai', '3'), ('s', 'ui', '2'), ('s', 'ui', '2'), (None,),
                    ('g', 'ua', '2'), ('ʔ', 'ai', '3'), ('s', 'ui', '2'), ('s', 'ui', '2'), (None,), ])
        變調了 = 拆文分析器.建立章物件('我愛媠媠。我愛媠媠。')
        self._設定音值(變調了,
                   [('g', 'ua', '1'), ('ʔ', 'ai', '2'), ('s', 'ui', '1'), ('s', 'ui', '2'), (None,),
                    ('g', 'ua', '1'), ('ʔ', 'ai', '2'), ('s', 'ui', '1'), ('s', 'ui', '2'), (None,), ])
        self.assertEqual(閩南語變調.變調(原本), 變調了)

    def test_章物件句尾變調原本物件無變(self):
        原本 = 拆文分析器.建立章物件('我愛媠媠。我愛媠媠。')
        self._設定音值(原本,
                   [('g', 'ua', '2'), ('ʔ', 'ai', '3'), ('s', 'ui', '2'), ('s', 'ui', '2'), (None,),
                    ('g', 'ua', '2'), ('ʔ', 'ai', '3'), ('s', 'ui', '2'), ('s', 'ui', '2'), (None,), ])
        原本物件 = 章(原本.內底句)
        閩南語變調.變調(原本)
        self.assertEqual(原本, 原本物件)

    def _設定音值(self, 物件, 音值陣列):
        字陣列 = 字物件篩仔.篩出字物件(物件)
        self.assertEqual(len(字陣列), len(音值陣列))
        for 字物件, 音值 in zip(字陣列, 音值陣列):
            字物件.音 = 音值
