'''
Created on 2018年4月12日

@author: wenli
'''


聲對照表 = {
    'p': 'p', 'ph': 'ph', 'm': 'm', 'b': 'b',
    't': '', 'th': '', 'n': '', 'l': '',
    'k': '', 'kh': '', 'ng': '', 'g': '',
    'ts': 'ch', 'tsh': 'chh', 's': '', 'j': '',
    'h': '', '': '',
}

韻對照表 = {
    'a': '', 'am': '', 'an': '', 'ang': '',
    'ah': '', 'ap': '', 'at': '', 'ak': '',
    'ann': '', 'annh': '',
    'ai': '', 'aih': '', 'ainn': '', 'ainnh': '',
    'au': '', 'auh': '', 'aunn': '', 'aunnh': '',
    'e': '', 'eh': '', 'enn': '', 'ennh': '',
    'ia': '', 'iah': '', 'iap': '', 'iat': '', 'iak': '',
    'iam': '', 'ian': '', 'iang': '',
    'iann': '', 'iannh': '',
    'iau': '', 'iauh': '', 'iaunn': '', 'iaunnh': '',
    'i': '', 'ih': '', 'ip': '', 'it': '', 'ik': '',
    'im': '', 'in': '', 'ing': '',
    'inn': '', 'innh': '',
    'io': '', 'ioh': '',
    'ioo': '', 'iooh': '', 'ionn': '', 'iok': '', 'iong': '',
    'iu': '', 'iuh': '', 'iut': '', 'iunn': '', 'iunnh': '',
    'm': '', 'mh': '', 'ng': '', 'ngh': '',
    'o': '', 'oh': '', 'op': '',
    'om': '', 'ong': '',
    'oo': '', 'ooh': '', 'ok': '', 'onn': '', 'onnh': '',
    'oi': '', 'oih': '',
    'ua': '', 'uah': '', 'uat': '', 'uak': '',
    'uann': '', 'uannh': '', 'uan': '',
    'uai': '', 'uaih': '', 'uainn': '', 'uainnh': '',
    'ue': '', 'ueh': '', 'uenn': '', 'uennh': '',
    'ui': '', 'uih': '', 'uinn': '', 'uinnh': '',
    'u': '', 'uh': '', 'ut': '',
    'un': '',
    # 下跤是次方言
    'or': '', 'orh': '', 'ior': '', 'iorh': '',
    'eng': '',
    'ee': '', 'eeh': '', 'uee': '',  # 有問題
    'ir': '', 'irh': '', 'irp': '', 'irt': '', 'irk': '',  # 有問題
    'irm': '', 'irn': '', 'irng': '', 'irinn': '',  # 有問題
    'er': '', 'erh': '', 'erm': '', 'erm': '',
    'ere': '', 'ereh': '',
    'ie': '', 'uang': '',
}

調對照表 = {
    '1': '', '7': '', '3': '', '2': '', '5': '',
    '8': '', '4': '', '10': '', '9': '',
    '6': '', '0': '',
}
