"""
著作權所有 (C) 民國102年 意傳文化科技
開發者：薛丞宏
網址：http://意傳.台灣
語料來源：請看各資料庫內說明

本程式乃自由軟體，您必須遵照SocialCalc設計的通用公共授權（Common Public Attribution License, CPAL)來修改和重新發佈這一程式，詳情請參閱條文。授權大略如下，若有歧異，以授權原文為主：
	１．得使用、修改、複製並發佈此程式碼，且必須以通用公共授權發行；
	２．任何以程式碼衍生的執行檔或網路服務，必須公開該程式碼；
	３．將此程式的原始碼當函式庫引用入商業軟體，且不需公開非關此函式庫的任何程式碼

此開放原始碼、共享軟體或說明文件之使用或散佈不負擔保責任，並拒絕負擔因使用上述軟體或說明文件所致任何及一切賠償責任或損害。

臺灣言語工具緣起於本土文化推廣與傳承，非常歡迎各界用於商業軟體，但希望在使用之餘，能夠提供建議、錯誤回報或修補，回饋給這塊土地。

感謝您的使用與推廣～～勞力！承蒙！
"""
from 資料庫.資料庫連線 import 資料庫連線
from 資料庫.欄位資訊 import 閩南語


教育部閩南語辭典空白符號 = '\u3000 \t'
教育部閩南語辭典隔開符號 = '\u3000'
俗音記號 = '??????'
合音記號 = '------'

揣字方言差 = 資料庫連線.prepare('SELECT * ' +
	'FROM "教育部臺灣閩南語常用詞辭典"."語音方言差" WHERE "字號"=$1 ')
揣詞方言差 = 資料庫連線.prepare('SELECT * ' +
	'FROM "教育部臺灣閩南語常用詞辭典"."詞彙方言差" WHERE "詞彙編號"=$1 ')

字方言差欄位 = [閩南語 + 地區 + '腔' for 地區 in 揣字方言差.column_names[3:]]
詞方言差欄位 = [閩南語 + 地區 + '腔' for 地區 in 揣詞方言差.column_names[3:]]

教育部閩南語辭典名 = '教育部臺灣閩南語常用詞辭典'
教育部閩南語辭典地區 = '臺員'
教育部閩南語辭典年代 = 97

揣主條目 = 資料庫連線.prepare('SELECT "主編號","屬性","詞目","音讀","方言差" ' +
	'FROM "教育部臺灣閩南語常用詞辭典"."詞目總檔" WHERE "主編號">= $1  ORDER BY "主編號" ASC')
揣義倒詞的詞音 = 資料庫連線.prepare('SELECT "另注音讀" ' +
	'FROM "教育部臺灣閩南語常用詞辭典"."反義詞對應" WHERE "反義詞" = $1 ORDER BY "流水號"')
揣義近詞的詞音 = 資料庫連線.prepare('SELECT "另注音讀" ' +
	'FROM "教育部臺灣閩南語常用詞辭典"."近義詞對應" WHERE "近義詞對應" = $1 ORDER BY "流水號"')
揣詞別音 = 資料庫連線.prepare('SELECT "又音" ' +
	'FROM "教育部臺灣閩南語常用詞辭典"."又音" WHERE "主編號"=$1 AND "屬性" = \'又唸作\' ' +
	' ORDER BY "流水號"')
揣詞俗音 = 資料庫連線.prepare('SELECT "又音" ' +
	'FROM "教育部臺灣閩南語常用詞辭典"."又音" WHERE "主編號"=$1 AND "屬性" = \'俗唸作\' ' +
	' ORDER BY "流水號"')
揣詞合音 = 資料庫連線.prepare('SELECT "又音" ' +
	'FROM "教育部臺灣閩南語常用詞辭典"."又音" WHERE "主編號"=$1 AND "屬性" = \'合音唸作\' ' +
	' ORDER BY "流水號"')

設定來源指令 = 資料庫連線.prepare('INSERT INTO "言語來源"."教育部臺灣閩南語常用詞辭典來源" ' +
	'("流水號","主編號") ' + 'VALUES ($1,$2)')
揣來源指令 = 資料庫連線.prepare('SELECT "流水號","主編號" FROM "言語來源"."教育部臺灣閩南語常用詞辭典來源" ' +
	'WHERE "流水號"=$1 and "主編號"=$2')
def 設定來源(流水號, 主編號):
	if 揣來源指令.first(流水號, 主編號) == None:
		設定來源指令(流水號, 主編號)
用來源主號碼揣流水號 = 資料庫連線.prepare('SELECT "流水號" FROM "言語來源"."教育部臺灣閩南語常用詞辭典來源" ' +
	'WHERE "主編號"=$1')
# 揣文字上大流水號資料 = 資料庫連線.prepare('SELECT MAX("流水號") ' +
# 	'FROM "言語"."文字"')
# 揣文字上大流水號 = lambda:揣文字上大流水號資料.first()


# 資料庫加文字 = 資料庫連線.prepare('INSERT INTO "言語"."文字" ' +
# 	'("來源","種類","腔口","地區","年代","型體","音標") ' +
# 	'VALUES (\'教育部臺灣閩南語常用詞辭典\',$1,$2,\'臺員\',\'97\',$3,$4) ')
#
# def 加文字(種類, 腔口, 型體, 音標):
# 	資料庫加文字(種類, 腔口, 型體, 音標)
# 	流水號 = 揣文字上大流水號()
# 	加編修狀況(流水號, '文字')

設定編修狀況 = 資料庫連線.prepare('UPDATE "言語"."編修" ' +
	'SET "版本"=$2 ' + ' WHERE "編修目標流水號"=$1')

揣義倒詞組合 = 資料庫連線.prepare('SELECT "主編號","反義詞" ' +
	'FROM "教育部臺灣閩南語常用詞辭典"."反義詞對應" ORDER BY "流水號"')
揣義近詞組合 = 資料庫連線.prepare('SELECT "主編號","近義詞對應" ' +
	'FROM "教育部臺灣閩南語常用詞辭典"."近義詞對應" ORDER BY "流水號"')
揣文白流水號 = 資料庫連線.prepare('SELECT "主編號","詞目","文白俗替" FROM "教育部臺灣閩南語常用詞辭典"."詞目總檔" ' +
	'WHERE "文白俗替" = \'文\' OR "文白俗替" = \'白\' ORDER BY "詞目" ASC, "文白俗替" ASC')

# 8016 8055 WHERE "流水號">=8055
# 揣釋義 = 資料庫連線.prepare('SELECT "流水號","主編號","義項順序","詞性","釋義" ' +
# 	'FROM "教育部臺灣閩南語常用詞辭典"."釋義" ORDER BY "流水號"')
主編號揣釋義 =lambda 主編號: 資料庫連線.prepare('SELECT "流水號","主編號","義項順序","詞性","釋義" ' +
	'FROM "教育部臺灣閩南語常用詞辭典"."釋義" WHERE "主編號"=$1 ORDER BY "流水號"')(主編號)

用釋義揣例句 = 資料庫連線.prepare('SELECT "例句","標音","例句翻譯" ' +
	'FROM "教育部臺灣閩南語常用詞辭典"."例句" WHERE "釋義編號"=$1 ORDER BY "流水號" ASC ')
用流水號揣腔口 = lambda 流水號:資料庫連線.prepare('SELECT "腔口" ' +
	'FROM "言語"."文字" WHERE "流水號"=$1').first(流水號)
揣例句 = 資料庫連線.prepare('SELECT "釋義編號","例句","標音" ' +
	'FROM "教育部臺灣閩南語常用詞辭典"."例句" ORDER BY "流水號" ASC ')

文字無音設定 = 資料庫連線.prepare('UPDATE "言語"."文字" ' +
	'SET "音標"=NULL WHERE "音標"=\'\'')

查詞性對照 = 資料庫連線.prepare('SELECT "詞性","詞性內容" ' +
	'FROM "教育部臺灣閩南語常用詞辭典"."詞性對照" ORDER BY "詞性" ASC ')
詞性對照表 = {詞性:詞性內容 for 詞性, 詞性內容 in 查詞性對照()}
詞性對照表[0] = '毋知'
設定詞性 = 資料庫連線.prepare('UPDATE "言語"."關係" ' +
	'SET "詞性"=$2 WHERE "流水號"=$1')
