# print('教育部臺灣閩南語常用詞辭典.整合到文字')
# import 教育部臺灣閩南語常用詞辭典.整合到文字
# del 教育部臺灣閩南語常用詞辭典.整合到文字
# print('教育部臺灣閩南語常用詞辭典.整合義近倒佮文白')
# import 教育部臺灣閩南語常用詞辭典.整合義近倒佮文白
# del 教育部臺灣閩南語常用詞辭典.整合義近倒佮文白
# print('教育部臺灣閩南語常用詞辭典.整合釋義佮例句')
# import 教育部臺灣閩南語常用詞辭典.整合釋義佮例句
# del 教育部臺灣閩南語常用詞辭典.整合釋義佮例句
# 
# print('華語台語雙語語料庫系統.整合平行語料')
# import 華語台語雙語語料庫系統.整合平行語料
# del 華語台語雙語語料庫系統.整合平行語料
# 
# for i in range(2):
# 	print('言語資料庫.產生文字組合')
# 	import 言語資料庫.產生文字組合
# 	del 言語資料庫.產生文字組合
from 資料佮語料匯入整合.教育部臺灣閩南語常用詞辭典.整合到文字 import 整合到文字
from 資料佮語料匯入整合.教育部臺灣閩南語常用詞辭典.整合義近倒佮文白 import 整合義近倒後佮文白
if __name__ == '__main__':
	整合到文字()
	整合義近倒後佮文白()
