from unittest.case import TestCase
from 臺灣言語工具.解析整理.拆文分析器 import 拆文分析器
from 臺灣言語工具.解析整理.型態錯誤 import 型態錯誤
from 臺灣言語工具.基本元素.組 import 組
from 臺灣言語工具.綜合標音.閩南語字綜合標音 import 閩南語字綜合標音
from 臺灣言語工具.基本元素.字 import 字
from 臺灣言語工具.基本元素.公用變數 import 無音
from 臺灣言語工具.基本元素.詞 import 詞
from 臺灣言語工具.解析整理.解析錯誤 import 解析錯誤


class 組單元試驗(TestCase):

    def test_組烏白傳(self):
        self.assertRaises(型態錯誤, 組, None)
        self.assertRaises(型態錯誤, 組, [None])
        self.assertRaises(型態錯誤, 組, ['sui2'])

    def test_看組孤字(self):
        型 = '恁老母ti3佗位！'
        音 = 'lin1 lau3 bu2 ti3 to1 ui7 !'
        組物件 = 拆文分析器.產生對齊組(型, 音)
        self.assertEqual(組物件.看型(), 型)
        self.assertEqual(組物件.看音(), 音)
        分詞 = '恁｜lin1 老｜lau3 母｜bu2 ti3｜ti3 佗｜to1 位｜ui7 ！｜!'
        self.assertEqual(組物件.看分詞(), 分詞)

    def test_看組連字(self):
        型 = '恁老母ti3佗位！'
        音 = 'lin1 lau3-bu2 ti3 to1-ui7 !'
        組物件 = 拆文分析器.產生對齊組(型, 音)
        self.assertEqual(組物件.看型(), 型)
        self.assertEqual(組物件.看音(), 音)
        分詞 = '恁｜lin1 老-母｜lau3-bu2 ti3｜ti3 佗-位｜to1-ui7 ！｜!'
        self.assertEqual(組物件.看分詞(), 分詞)

    def test_接受無音的詞(self):
        組物件 = 拆文分析器.建立組物件('')
        組物件.內底詞 = [
            拆文分析器.建立詞物件('梅山'),
            拆文分析器.建立詞物件('猴-災'),
            拆文分析器.產生對齊詞('鄉-公所', 'hiong1-kong1-soo2'),
            拆文分析器.建立詞物件('tshiann2-lang5'),
            拆文分析器.產生對齊詞('趕-走', 'kuann2-tsau2'),
            拆文分析器.產生對齊詞('猴山', 'kau5-san1'),
        ]
        分詞答案 = '梅-山 猴-災 鄉-公-所｜hiong1-kong1-soo2 tshiann2-lang5 趕-走｜kuann2-tsau2 猴-山｜kau5-san1'
        self.assertEqual(組物件.看分詞(), 分詞答案)

    def test_有字無音的詞(self):
        公詞物件 = 拆文分析器.建立詞物件('')
        公詞物件.內底字 = [
            拆文分析器.建立字物件('鄉'),
            拆文分析器.產生對齊字('公', 'kong1'),
            拆文分析器.建立字物件('所'),
        ]
        鄉所詞物件 = 拆文分析器.建立詞物件('')
        鄉所詞物件.內底字 = [
            拆文分析器.產生對齊字('鄉', 'hiang1'),
            拆文分析器.建立字物件('公'),
            拆文分析器.產生對齊字('所', 'soo2'),
        ]
        公鄉所組物件 = 拆文分析器.建立組物件('')
        公鄉所組物件.內底詞 = [公詞物件, 鄉所詞物件]
        self.assertEqual(
            公鄉所組物件.看分詞(),
            '鄉-公-所｜-kong1- 鄉-公-所｜hiang1--soo2'
        )

    def test_綜合標音結果對照(self):
        組物件 = 拆文分析器.產生對齊組('大美女', 'tua7 sui2-boo2')
        綜合標音 = 組物件.綜合標音(閩南語字綜合標音)
        self.assertEqual(len(綜合標音['詞組綜合標音']), 3)
        self.assertEqual(綜合標音['詞組綜合標音'][0], 字('大', 'tua7').綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音['詞組綜合標音'][1], 字('美', 'sui2').綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音['詞組綜合標音'][2], 字('女', 'boo2').綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音['連字音'], 'tua7 sui2-boo2')

    def test_綜合標音連字音檢查(self):
        組物件 = 組([拆文分析器.產生對齊詞('大', 'tua7'),
                 拆文分析器.產生對齊詞('美女', 'sui2-boo2')])
        綜合標音 = 組物件.綜合標音(閩南語字綜合標音)
        self.assertEqual(len(綜合標音['詞組綜合標音']), 3)
        self.assertEqual(綜合標音['詞組綜合標音'][0], 字('大', 'tua7').綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音['詞組綜合標音'][1], 字('美', 'sui2').綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音['詞組綜合標音'][2], 字('女', 'boo2').綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音['連字音'], 'tua7 sui2-boo2')

    def test_有標點符號綜合標音(self):
        詞型 = '點仔膠，黏著跤，'
        詞音 = 'tiam2-a2-ka1 , liam5-tioh8 kha1 ,'
        組物件 = 拆文分析器.產生對齊組(詞型, 詞音)
        綜合標音 = 組物件.綜合標音(閩南語字綜合標音)
        self.assertEqual(len(綜合標音['詞組綜合標音']), 8)
        self.assertEqual(綜合標音['詞組綜合標音'][0], 字('點', 'tiam2').綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音['詞組綜合標音'][1], 字('仔', 'a2').綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音['詞組綜合標音'][2], 字('膠', 'ka1').綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音['詞組綜合標音'][3], 字('，', ',').綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音['詞組綜合標音'][4], 字('黏', 'liam5').綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音['詞組綜合標音'][5], 字('著', 'tioh8').綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音['詞組綜合標音'][6], 字('跤', 'kha1').綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音['詞組綜合標音'][7], 字('，', ',').綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音['連字音'], 'tiam2-a2-ka1 , liam5-tioh8 kha1 ,')

    def test_有無音字綜合標音(self):
        組物件 = 組([拆文分析器.產生對齊詞('點仔膠', 'tiam2-a2-ka1'),
                 拆文分析器.建立詞物件('，'),
                 拆文分析器.產生對齊詞('黏著', 'liam5-tioh8'),
                 拆文分析器.產生對齊詞('跤', 'kha1'),
                 拆文分析器.建立詞物件('，'),
                 ])
        綜合標音 = 組物件.綜合標音(閩南語字綜合標音)
        self.assertEqual(len(綜合標音['詞組綜合標音']), 8)
        self.assertEqual(綜合標音['詞組綜合標音'][0], 字('點', 'tiam2').綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音['詞組綜合標音'][1], 字('仔', 'a2').綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音['詞組綜合標音'][2], 字('膠', 'ka1').綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音['詞組綜合標音'][3], 字('，', 無音).綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音['詞組綜合標音'][4], 字('黏', 'liam5').綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音['詞組綜合標音'][5], 字('著', 'tioh8').綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音['詞組綜合標音'][6], 字('跤', 'kha1').綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音['詞組綜合標音'][7], 字('，', 無音).綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音['連字音'], 'tiam2-a2-ka1 liam5-tioh8 kha1')

    def test_綜合標音詞中有無音字(self):
        組物件 = 組([
            詞([拆文分析器.產生對齊字('點', 'tiam2'),
               拆文分析器.建立字物件('仔'),
               拆文分析器.產生對齊字('膠', 'ka1')]),
            拆文分析器.建立詞物件('，'),
            拆文分析器.產生對齊詞('黏著', 'liam5-tioh8'),
            拆文分析器.產生對齊詞('跤', 'kha1'),
            拆文分析器.建立詞物件('，'),
        ])
        綜合標音 = 組物件.綜合標音(閩南語字綜合標音)
        self.assertEqual(len(綜合標音['詞組綜合標音']), 8)
        self.assertEqual(綜合標音['詞組綜合標音'][0], 字('點', 'tiam2').綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音['詞組綜合標音'][1], 字('仔').綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音['詞組綜合標音'][2], 字('膠', 'ka1').綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音['詞組綜合標音'][3], 字('，', 無音).綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音['詞組綜合標音'][4], 字('黏', 'liam5').綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音['詞組綜合標音'][5], 字('著', 'tioh8').綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音['詞組綜合標音'][6], 字('跤', 'kha1').綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音['詞組綜合標音'][7], 字('，', 無音).綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音['連字音'], 'tiam2-ka1 liam5-tioh8 kha1')

    def test_一組綜合標音json格式(self):
        組物件 = 拆文分析器.產生對齊組('椅仔', 'i2-a2')
        self.assertEqual(組物件.綜合標音(閩南語字綜合標音), {
            "詞組綜合標音": [
                {"型體": "椅", "臺羅數字調": "i2", "臺羅閏號調": "í",
                 "通用數字調": "i4", "吳守禮方音": "⿿ㄧˋ"},
                {"型體": "仔", "臺羅數字調": "a2", "臺羅閏號調": "á",
                 "通用數字調": "a4", "吳守禮方音": "⿿ㄚˋ"}
            ],
            "連字音": "i2-a2"
        })

    def test_一組兩詞綜合標音json格式(self):
        組物件 = 拆文分析器.產生對齊組('椅仔', 'i2 a2')
        self.assertEqual(組物件.綜合標音(閩南語字綜合標音), {
            "詞組綜合標音": [
                {"型體": "椅", "臺羅數字調": "i2", "臺羅閏號調": "í",
                 "通用數字調": "i4", "吳守禮方音": "⿿ㄧˋ"},
                {"型體": "仔", "臺羅數字調": "a2", "臺羅閏號調": "á",
                 "通用數字調": "a4", "吳守禮方音": "⿿ㄚˋ"}
            ],
            "連字音": "i2 a2"
        })

    def test_空組綜合標音(self):
        組物件 = 組()
        with self.assertRaises(解析錯誤):
            組物件.綜合標音(閩南語字綜合標音)
