from unittest.case import TestCase
from 臺灣言語工具.解析整理.拆文分析器 import 拆文分析器
from 臺灣言語工具.基本元素.集 import 集
from 臺灣言語工具.解析整理.解析錯誤 import 解析錯誤
from 臺灣言語工具.解析整理.型態錯誤 import 型態錯誤
from 臺灣言語工具.綜合標音.閩南語字綜合標音 import 閩南語字綜合標音
from 臺灣言語工具.基本元素.字 import 字
from 臺灣言語工具.基本元素.公用變數 import 無音


class 集單元試驗(TestCase):

    def test_集烏白傳(self):
        self.assertRaises(型態錯誤, 集, None)
        self.assertRaises(型態錯誤, 集, [None])
        self.assertRaises(型態錯誤, 集, ['sui2'])

    def test_看集(self):
        型 = '恁老母ti3佗位'
        音 = 'lin1 lau3 bu2 ti3 to1 ui7'
        集物件 = 拆文分析器.產生對齊集(型, 音)
        self.assertEqual(集物件.看型(), 型)
        self.assertEqual(集物件.看音(), 音)
        分詞 = '恁｜lin1 老｜lau3 母｜bu2 ti3｜ti3 佗｜to1 位｜ui7'
        self.assertEqual(集物件.看分詞(), 分詞)

    def test_看集內底有兩組以上(self):
        型 = '恁老母ti3佗位'
        音 = 'lin1 lau3 bu2 ti3 to1 ui7'
        集物件 = 集([拆文分析器.產生對齊組(型, 音), 拆文分析器.產生對齊組(型, 音)])
        self.assertRaises(解析錯誤, 集物件.看型)
        self.assertRaises(解析錯誤, 集物件.看音)
        self.assertRaises(解析錯誤, 集物件.看分詞)

    def test_基本綜合標音(self):
        媠某 = 拆文分析器.產生對齊組('美女', 'sui2-boo2')
        美女 = 拆文分析器.產生對齊組('美女', 'mi2-lu2')
        集物件 = 集([媠某, 美女])
        綜合標音 = 集物件.綜合標音(閩南語字綜合標音)
        self.assertEqual(len(綜合標音), 2)
        self.assertEqual(綜合標音[0], 媠某.綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音[1], 美女.綜合標音(閩南語字綜合標音))

    def test_有無音字(self):
        集物件 = 集([拆文分析器.產生對齊組('點仔膠', 'tiam2-a2-ka1'),
                 拆文分析器.建立組物件('，'),
                 拆文分析器.產生對齊組('黏著跤', 'liam5-tioh8 kha1'),
                 拆文分析器.建立組物件('，'),
                 ])
        綜合標音 = 集物件.綜合標音(閩南語字綜合標音)
        self.assertEqual(len(綜合標音), 4)
        self.assertEqual(len(綜合標音[0]['詞組綜合標音']), 3)
        self.assertEqual(len(綜合標音[1]['詞組綜合標音']), 1)
        self.assertEqual(len(綜合標音[2]['詞組綜合標音']), 3)
        self.assertEqual(len(綜合標音[3]['詞組綜合標音']), 1)
        self.assertEqual(綜合標音[0]['詞組綜合標音'][0], 字('點', 'tiam2').綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音[0]['詞組綜合標音'][1], 字('仔', 'a2').綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音[0]['詞組綜合標音'][2], 字('膠', 'ka1').綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音[1]['詞組綜合標音'][0], 字('，', 無音).綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音[2]['詞組綜合標音'][0], 字('黏', 'liam5').綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音[2]['詞組綜合標音'][1], 字('著', 'tioh8').綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音[2]['詞組綜合標音'][2], 字('跤', 'kha1').綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音[3]['詞組綜合標音'][0], 字('，', 無音).綜合標音(閩南語字綜合標音))
        self.assertEqual(綜合標音[0]['連字音'], 'tiam2-a2-ka1')
        self.assertEqual(綜合標音[1]['連字音'], '')
        self.assertEqual(綜合標音[2]['連字音'], 'liam5-tioh8 kha1')
        self.assertEqual(綜合標音[3]['連字音'], '')

    def test_孤字轉json格式(self):
        白組物件 = 拆文分析器.產生對齊組('一', 'tsit8')
        文組物件 = 拆文分析器.產生對齊組('一', 'it4')
        集物件 = 集([白組物件, 文組物件])
        self.assertEqual(集物件.綜合標音(閩南語字綜合標音), [
            {"詞組綜合標音": [{"型體": "一", "臺羅數字調": "tsit8", "臺羅閏號調": "tsı̍t", "通用數字調": "zit6", "吳守禮方音": "⿿⿿⿿ㄐㄧ㆐ㆵ"}],
             "連字音": "tsit8"},
            {"詞組綜合標音": [{"型體": "一", "臺羅數字調": "it4", "臺羅閏號調": "it", "通用數字調": "it7", "吳守禮方音": "⿿ㄧㆵ"}],
             "連字音": "it4"}
        ])

    def test_孤字json格式佮下跤轉仝款(self):
        白組物件 = 拆文分析器.產生對齊組('一', 'tsit8')
        文組物件 = 拆文分析器.產生對齊組('一', 'it4')
        集物件 = 集([白組物件, 文組物件])
        組的標音詞組 = [
            白組物件.閩南語字綜合標音(閩南語字綜合標音),
            文組物件.閩南語字綜合標音(閩南語字綜合標音),
        ]
        self.assertEqual(集物件.綜合標音(閩南語字綜合標音), 組的標音詞組)

    def test_一詞轉json格式(self):
        集物件 = 拆文分析器.產生對齊集('椅仔', 'i2-a2')
        self.assertEqual(集物件.綜合標音(閩南語字綜合標音), [
            {"詞組綜合標音": [
                {"型體": "椅", "臺羅數字調": "i2", "臺羅閏號調": "í",
                    "通用數字調": "i4", "吳守禮方音": "⿿ㄧˋ"},
                {"型體": "仔", "臺羅數字調": "a2", "臺羅閏號調": "á",
                    "通用數字調": "a4", "吳守禮方音": "⿿ㄚˋ"}
            ], "連字音": "i2-a2"}
        ])

    def test_文白一詞轉json格式(self):
        白組物件 = 拆文分析器.產生對齊組('大人', 'tua7-lang5')
        文組物件 = 拆文分析器.產生對齊組('大人', 'tai7-jin5')
        集物件 = 集([白組物件, 文組物件])
        self.assertEqual(集物件.綜合標音(閩南語字綜合標音), [
            {"詞組綜合標音": [
                {"型體": "大", "臺羅數字調": "tua7", "臺羅閏號調": "tuā",
                    "通用數字調": "dua2", "吳守禮方音": "⿿⿿⿿ㄉㄨㄚ˫"},
                {"型體": "人", "臺羅數字調": "lang5", "臺羅閏號調": "lâng", "通用數字調": "lang5", "吳守禮方音": "⿿⿿ㄌㄤˊ"}],
             "連字音": "tua7-lang5"},
            {"詞組綜合標音": [
                {"型體": "大", "臺羅數字調": "tai7", "臺羅閏號調": "tāi",
                    "通用數字調": "dai2", "吳守禮方音": "⿿⿿ㄉㄞ˫"},
                {"型體": "人", "臺羅數字調": "jin5", "臺羅閏號調": "jîn", "通用數字調": "rin5", "吳守禮方音": "⿿⿿⿿ㆢㄧㄣˊ"}],
             "連字音": "tai7-jin5"},
        ])

    def test_文白一詞json格式佮下跤轉仝款(self):
        白組物件 = 拆文分析器.產生對齊組('大人', 'tua7-lang5')
        文組物件 = 拆文分析器.產生對齊組('大人', 'tai7-jin5')
        集物件 = 集([白組物件, 文組物件])
        組的標音詞組 = [
            白組物件.閩南語字綜合標音(閩南語字綜合標音),
            文組物件.閩南語字綜合標音(閩南語字綜合標音),
        ]
        self.assertEqual(集物件.綜合標音(閩南語字綜合標音), 組的標音詞組)
